garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern volatile DMAnSSAUbits_t DMAnSSAUbits __at(0x0FA);
// bitfield macros
#define _DMAnSSAU_SSA_POSN                                  0x0
#define _DMAnSSAU_SSA_POSITION                              0x0
#define _DMAnSSAU_SSA_SIZE                                  0x8
#define _DMAnSSAU_SSA_LENGTH                                0x8
#define _DMAnSSAU_SSA_MASK                                  0xFF
#define _DMAnSSAU_SSA16_POSN                                0x0
#define _DMAnSSAU_SSA16_POSITION                            0x0
#define _DMAnSSAU_SSA16_SIZE                                0x1
#define _DMAnSSAU_SSA16_LENGTH                              0x1
#define _DMAnSSAU_SSA16_MASK                                0x1
#define _DMAnSSAU_SSA17_POSN                                0x1
#define _DMAnSSAU_SSA17_POSITION                            0x1
#define _DMAnSSAU_SSA17_SIZE                                0x1
#define _DMAnSSAU_SSA17_LENGTH                              0x1
#define _DMAnSSAU_SSA17_MASK                                0x2
#define _DMAnSSAU_SSA18_POSN                                0x2
#define _DMAnSSAU_SSA18_POSITION                            0x2
#define _DMAnSSAU_SSA18_SIZE                                0x1
#define _DMAnSSAU_SSA18_LENGTH                              0x1
#define _DMAnSSAU_SSA18_MASK                                0x4
#define _DMAnSSAU_SSA19_POSN                                0x3
#define _DMAnSSAU_SSA19_POSITION                            0x3
#define _DMAnSSAU_SSA19_SIZE                                0x1
#define _DMAnSSAU_SSA19_LENGTH                              0x1
#define _DMAnSSAU_SSA19_MASK                                0x8
#define _DMAnSSAU_SSA20_POSN                                0x4
#define _DMAnSSAU_SSA20_POSITION                            0x4
#define _DMAnSSAU_SSA20_SIZE                                0x1
#define _DMAnSSAU_SSA20_LENGTH                              0x1
#define _DMAnSSAU_SSA20_MASK                                0x10
#define _DMAnSSAU_SSA21_POSN                                0x5
#define _DMAnSSAU_SSA21_POSITION                            0x5
#define _DMAnSSAU_SSA21_SIZE                                0x1
#define _DMAnSSAU_SSA21_LENGTH                              0x1
#define _DMAnSSAU_SSA21_MASK                                0x20

// Register: DMAnCON0
#define DMAnCON0 DMAnCON0
extern volatile unsigned char           DMAnCON0            __at(0x0FB);
#ifndef _LIB_BUILD
asm("DMAnCON0 equ 0FBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
} DMAnCON0bits_t;
extern volatile DMAnCON0bits_t DMAnCON0bits __at(0x0FB);
// bitfield macros
#define _DMAnCON0_XIP_POSN                                  0x0
#define _DMAnCON0_XIP_POSITION                              0x0
#define _DMAnCON0_XIP_SIZE                                  0x1
#define _DMAnCON0_XIP_LENGTH                                0x1
#define _DMAnCON0_XIP_MASK                                  0x1
#define _DMAnCON0_AIRQEN_POSN                               0x2
#define _DMAnCON0_AIRQEN_POSITION                           0x2
#define _DMAnCON0_AIRQEN_SIZE                               0x1
#define _DMAnCON0_AIRQEN_LENGTH                             0x1
#define _DMAnCON0_AIRQEN_MASK                               0x4
#define _DMAnCON0_DGO_POSN                                  0x5
#define _DMAnCON0_DGO_POSITION                              0x5
#define _DMAnCON0_DGO_SIZE                                  0x1
#define _DMAnCON0_DGO_LENGTH                                0x1
#define _DMAnCON0_DGO_MASK                                  0x20
#define _DMAnCON0_SIRQEN_POSN                               0x6
#define _DMAnCON0_SIRQEN_POSITION                           0x6
#define _DMAnCON0_SIRQEN_SIZE                               0x1
#define _DMAnCON0_SIRQEN_LENGTH                             0x1
#define _DMAnCON0_SIRQEN_MASK                               0x40
#define _DMAnCON0_EN_POSN                                   0x7
#define _DMAnCON0_EN_POSITION                               0x7
#define _DMAnCON0_EN_SIZE                                   0x1
#define _DMAnCON0_EN_LENGTH                                 0x1
#define _DMAnCON0_EN_MASK                                   0x80

// Register: DMAnCON1
#define DMAnCON1 DMAnCON1
extern volatile unsigned char           DMAnCON1            __at(0x0FC);
#ifndef _LIB_BUILD
asm("DMAnCON1 equ 0FCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMAnCON1bits_t;
extern volatile DMAnCON1bits_t DMAnCON1bits __at(0x0FC);
// bitfield macros
#define _DMAnCON1_SSTP_POSN                                 0x0
#define _DMAnCON1_SSTP_POSITION                             0x0
#define _DMAnCON1_SSTP_SIZE                                 0x1
#define _DMAnCON1_SSTP_LENGTH                               0x1
#define _DMAnCON1_SSTP_MASK                                 0x1
#define _DMAnCON1_SMODE_POSN                                0x1
#define _DMAnCON1_SMODE_POSITION                            0x1
#define _DMAnCON1_SMODE_SIZE                                0x2
#define _DMAnCON1_SMODE_LENGTH                              0x2
#define _DMAnCON1_SMODE_MASK                                0x6
#define _DMAnCON1_SMR_POSN                                  0x3
#define _DMAnCON1_SMR_POSITION                              0x3
#define _DMAnCON1_SMR_SIZE                                  0x2
#define _DMAnCON1_SMR_LENGTH                                0x2
#define _DMAnCON1_SMR_MASK                                  0x18
#define _DMAnCON1_DSTP_POSN                                 0x5
#define _DMAnCON1_DSTP_POSITION                             0x5
#define _DMAnCON1_DSTP_SIZE                                 0x1
#define _DMAnCON1_DSTP_LENGTH                               0x1
#define _DMAnCON1_DSTP_MASK                                 0x20
#define _DMAnCON1_DMODE_POSN                                0x6
#define _DMAnCON1_DMODE_POSITION                            0x6
#define _DMAnCON1_DMODE_SIZE                                0x2
#define _DMAnCON1_DMODE_LENGTH                              0x2
#define _DMAnCON1_DMODE_MASK                                0xC0

