garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// Register: ADCG1B
#define ADCG1B ADCG1B
extern volatile unsigned char           ADCG1B              __at(0x111);
#ifndef _LIB_BUILD
asm("ADCG1B equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGB0                   :1;
        unsigned CGB1                   :1;
        unsigned CGB2                   :1;
        unsigned CGB3                   :1;
        unsigned CGB4                   :1;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
} ADCG1Bbits_t;
extern volatile ADCG1Bbits_t ADCG1Bbits __at(0x111);
// bitfield macros
#define _ADCG1B_CGB0_POSN                                   0x0
#define _ADCG1B_CGB0_POSITION                               0x0
#define _ADCG1B_CGB0_SIZE                                   0x1
#define _ADCG1B_CGB0_LENGTH                                 0x1
#define _ADCG1B_CGB0_MASK                                   0x1
#define _ADCG1B_CGB1_POSN                                   0x1
#define _ADCG1B_CGB1_POSITION                               0x1
#define _ADCG1B_CGB1_SIZE                                   0x1
#define _ADCG1B_CGB1_LENGTH                                 0x1
#define _ADCG1B_CGB1_MASK                                   0x2
#define _ADCG1B_CGB2_POSN                                   0x2
#define _ADCG1B_CGB2_POSITION                               0x2
#define _ADCG1B_CGB2_SIZE                                   0x1
#define _ADCG1B_CGB2_LENGTH                                 0x1
#define _ADCG1B_CGB2_MASK                                   0x4
#define _ADCG1B_CGB3_POSN                                   0x3
#define _ADCG1B_CGB3_POSITION                               0x3
#define _ADCG1B_CGB3_SIZE                                   0x1
#define _ADCG1B_CGB3_LENGTH                                 0x1
#define _ADCG1B_CGB3_MASK                                   0x8
#define _ADCG1B_CGB4_POSN                                   0x4
#define _ADCG1B_CGB4_POSITION                               0x4
#define _ADCG1B_CGB4_SIZE                                   0x1
#define _ADCG1B_CGB4_LENGTH                                 0x1
#define _ADCG1B_CGB4_MASK                                   0x10
#define _ADCG1B_CGB5_POSN                                   0x5
#define _ADCG1B_CGB5_POSITION                               0x5
#define _ADCG1B_CGB5_SIZE                                   0x1
#define _ADCG1B_CGB5_LENGTH                                 0x1
#define _ADCG1B_CGB5_MASK                                   0x20
#define _ADCG1B_CGB6_POSN                                   0x6
#define _ADCG1B_CGB6_POSITION                               0x6
#define _ADCG1B_CGB6_SIZE                                   0x1
#define _ADCG1B_CGB6_LENGTH                                 0x1
#define _ADCG1B_CGB6_MASK                                   0x40
#define _ADCG1B_CGB7_POSN                                   0x7
#define _ADCG1B_CGB7_POSITION                               0x7
#define _ADCG1B_CGB7_SIZE                                   0x1
#define _ADCG1B_CGB7_LENGTH                                 0x1
#define _ADCG1B_CGB7_MASK                                   0x80

// Register: ADCG1C
#define ADCG1C ADCG1C
extern volatile unsigned char           ADCG1C              __at(0x112);
#ifndef _LIB_BUILD
asm("ADCG1C equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned CGC2                   :1;
    };
} ADCG1Cbits_t;
extern volatile ADCG1Cbits_t ADCG1Cbits __at(0x112);
// bitfield macros
#define _ADCG1C_CGC0_POSN                                   0x0
#define _ADCG1C_CGC0_POSITION                               0x0
#define _ADCG1C_CGC0_SIZE                                   0x1
#define _ADCG1C_CGC0_LENGTH                                 0x1
#define _ADCG1C_CGC0_MASK                                   0x1
#define _ADCG1C_CGC1_POSN                                   0x1
#define _ADCG1C_CGC1_POSITION                               0x1
#define _ADCG1C_CGC1_SIZE                                   0x1
#define _ADCG1C_CGC1_LENGTH                                 0x1
#define _ADCG1C_CGC1_MASK                                   0x2
#define _ADCG1C_CGC2_POSN                                   0x2
#define _ADCG1C_CGC2_POSITION                               0x2
#define _ADCG1C_CGC2_SIZE                                   0x1
#define _ADCG1C_CGC2_LENGTH                                 0x1
#define _ADCG1C_CGC2_MASK                                   0x4

// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x140);
#ifndef _LIB_BUILD
asm("LATA equ 0140h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned LATA3                  :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
        unsigned LATA6                  :1;
        unsigned LATA7                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x140);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA3_POSN                                    0x3
#define _LATA_LATA3_POSITION                                0x3
#define _LATA_LATA3_SIZE                                    0x1
#define _LATA_LATA3_LENGTH                                  0x1
#define _LATA_LATA3_MASK                                    0x8
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20
#define _LATA_LATA6_POSN                                    0x6
#define _LATA_LATA6_POSITION                                0x6
#define _LATA_LATA6_SIZE                                    0x1
#define _LATA_LATA6_LENGTH                                  0x1
#define _LATA_LATA6_MASK                                    0x40
#define _LATA_LATA7_POSN                                    0x7
#define _LATA_LATA7_POSITION                                0x7
#define _LATA_LATA7_SIZE                                    0x1
#define _LATA_LATA7_LENGTH                                  0x1
#define _LATA_LATA7_MASK                                    0x80

// Register: LATB
#define LATB LATB
extern volatile unsigned char           LATB                __at(0x141);
#ifndef _LIB_BUILD
asm("LATB equ 0141h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATB0                  :1;
        unsigned LATB1                  :1;
        unsigned LATB2                  :1;
        unsigned LATB3                  :1;
        unsigned LATB4                  :1;
        unsigned LATB5                  :1;
        unsigned LATB6                  :1;
        unsigned LATB7                  :1;
    };
} LATBbits_t;
extern volatile LATBbits_t LATBbits __at(0x141);
// bitfield macros
#define _LATB_LATB0_POSN                                    0x0
#define _LATB_LATB0_POSITION                                0x0
#define _LATB_LATB0_SIZE                                    0x1
#define _LATB_LATB0_LENGTH                                  0x1
#define _LATB_LATB0_MASK                                    0x1
#define _LATB_LATB1_POSN                                    0x1
#define _LATB_LATB1_POSITION                                0x1
#define _LATB_LATB1_SIZE                                    0x1
#define _LATB_LATB1_LENGTH                                  0x1
#define _LATB_LATB1_MASK                                    0x2
#define _LATB_LATB2_POSN                                    0x2
#define _LATB_LATB2_POSITION                                0x2
#define _LATB_LATB2_SIZE                                    0x1
#define _LATB_LATB2_LENGTH                                  0x1
#define _LATB_LATB2_MASK                                    0x4
#define _LATB_LATB3_POSN                                    0x3
#define _LATB_LATB3_POSITION                                0x3
#define _LATB_LATB3_SIZE                                    0x1
#define _LATB_LATB3_LENGTH                                  0x1
#define _LATB_LATB3_MASK                                    0x8
#define _LATB_LATB4_POSN                                    0x4
#define _LATB_LATB4_POSITION                                0x4
#define _LATB_LATB4_SIZE                                    0x1
#define _LATB_LATB4_LENGTH                                  0x1
#define _LATB_LATB4_MASK                                    0x10
#define _LATB_LATB5_POSN                                    0x5
#define _LATB_LATB5_POSITION                                0x5
#define _LATB_LATB5_SIZE                                    0x1
#define _LATB_LATB5_LENGTH                                  0x1
#define _LATB_LATB5_MASK                                    0x20
#define _LATB_LATB6_POSN                                    0x6
#define _LATB_LATB6_POSITION                                0x6
#define _LATB_LATB6_SIZE                                    0x1
#define _LATB_LATB6_LENGTH                                  0x1
#define _LATB_LATB6_MASK                                    0x40
#define _LATB_LATB7_POSN                                    0x7
#define _LATB_LATB7_POSITION                                0x7
#define _LATB_LATB7_SIZE                                    0x1
#define _LATB_LATB7_LENGTH                                  0x1
#define _LATB_LATB7_MASK                                    0x80

