garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// Register: PORTWCLKPPS
#define PORTWCLKPPS PORTWCLKPPS
extern volatile unsigned char           PORTWCLKPPS         __at(0x27F);
#ifndef _LIB_BUILD
asm("PORTWCLKPPS equ 027Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PORTWCLKPPS            :6;
    };
    struct {
        unsigned PORTWCLKPPS0           :1;
        unsigned PORTWCLKPPS1           :1;
        unsigned PORTWCLKPPS2           :1;
        unsigned PORTWCLKPPS3           :1;
        unsigned PORTWCLKPPS4           :1;
        unsigned PORTWCLKPPS5           :1;
    };
} PORTWCLKPPSbits_t;
extern volatile PORTWCLKPPSbits_t PORTWCLKPPSbits __at(0x27F);
// bitfield macros
#define _PORTWCLKPPS_PIN_POSN                               0x0
#define _PORTWCLKPPS_PIN_POSITION                           0x0
#define _PORTWCLKPPS_PIN_SIZE                               0x3
#define _PORTWCLKPPS_PIN_LENGTH                             0x3
#define _PORTWCLKPPS_PIN_MASK                               0x7
#define _PORTWCLKPPS_PORT_POSN                              0x3
#define _PORTWCLKPPS_PORT_POSITION                          0x3
#define _PORTWCLKPPS_PORT_SIZE                              0x3
#define _PORTWCLKPPS_PORT_LENGTH                            0x3
#define _PORTWCLKPPS_PORT_MASK                              0x38
#define _PORTWCLKPPS_PORTWCLKPPS_POSN                       0x0
#define _PORTWCLKPPS_PORTWCLKPPS_POSITION                   0x0
#define _PORTWCLKPPS_PORTWCLKPPS_SIZE                       0x6
#define _PORTWCLKPPS_PORTWCLKPPS_LENGTH                     0x6
#define _PORTWCLKPPS_PORTWCLKPPS_MASK                       0x3F
#define _PORTWCLKPPS_PORTWCLKPPS0_POSN                      0x0
#define _PORTWCLKPPS_PORTWCLKPPS0_POSITION                  0x0
#define _PORTWCLKPPS_PORTWCLKPPS0_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS0_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS0_MASK                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_POSN                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_POSITION                  0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS1_MASK                      0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_POSN                      0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_POSITION                  0x2
#define _PORTWCLKPPS_PORTWCLKPPS2_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS2_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS2_MASK                      0x4
#define _PORTWCLKPPS_PORTWCLKPPS3_POSN                      0x3
#define _PORTWCLKPPS_PORTWCLKPPS3_POSITION                  0x3
#define _PORTWCLKPPS_PORTWCLKPPS3_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS3_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS3_MASK                      0x8
#define _PORTWCLKPPS_PORTWCLKPPS4_POSN                      0x4
#define _PORTWCLKPPS_PORTWCLKPPS4_POSITION                  0x4
#define _PORTWCLKPPS_PORTWCLKPPS4_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS4_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS4_MASK                      0x10
#define _PORTWCLKPPS_PORTWCLKPPS5_POSN                      0x5
#define _PORTWCLKPPS_PORTWCLKPPS5_POSITION                  0x5
#define _PORTWCLKPPS_PORTWCLKPPS5_SIZE                      0x1
#define _PORTWCLKPPS_PORTWCLKPPS5_LENGTH                    0x1
#define _PORTWCLKPPS_PORTWCLKPPS5_MASK                      0x20

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x284);
#ifndef _LIB_BUILD
asm("RC3I2C equ 0284h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x284);
// bitfield macros
#define _RC3I2C_TH_POSN                                     0x0
#define _RC3I2C_TH_POSITION                                 0x0
#define _RC3I2C_TH_SIZE                                     0x2
#define _RC3I2C_TH_LENGTH                                   0x2
#define _RC3I2C_TH_MASK                                     0x3
#define _RC3I2C_SLEW_POSN                                   0x6
#define _RC3I2C_SLEW_POSITION                               0x6
#define _RC3I2C_SLEW_SIZE                                   0x2
#define _RC3I2C_SLEW_LENGTH                                 0x2
#define _RC3I2C_SLEW_MASK                                   0xC0
#define _RC3I2C_TH0_POSN                                    0x0
#define _RC3I2C_TH0_POSITION                                0x0
#define _RC3I2C_TH0_SIZE                                    0x1
#define _RC3I2C_TH0_LENGTH                                  0x1
#define _RC3I2C_TH0_MASK                                    0x1
#define _RC3I2C_TH1_POSN                                    0x1
#define _RC3I2C_TH1_POSITION                                0x1
#define _RC3I2C_TH1_SIZE                                    0x1
#define _RC3I2C_TH1_LENGTH                                  0x1
#define _RC3I2C_TH1_MASK                                    0x2
#define _RC3I2C_SLEW0_POSN                                  0x6
#define _RC3I2C_SLEW0_POSITION                              0x6
#define _RC3I2C_SLEW0_SIZE                                  0x1
#define _RC3I2C_SLEW0_LENGTH                                0x1
#define _RC3I2C_SLEW0_MASK                                  0x40
#define _RC3I2C_SLEW1_POSN                                  0x7
#define _RC3I2C_SLEW1_POSITION                              0x7
#define _RC3I2C_SLEW1_SIZE                                  0x1
#define _RC3I2C_SLEW1_LENGTH                                0x1
#define _RC3I2C_SLEW1_MASK                                  0x80
#define _RC3I2C_I2CTH_POSN                                  0x0
#define _RC3I2C_I2CTH_POSITION                              0x0
#define _RC3I2C_I2CTH_SIZE                                  0x2
#define _RC3I2C_I2CTH_LENGTH                                0x2
#define _RC3I2C_I2CTH_MASK                                  0x3
#define _RC3I2C_I2CSLEW_POSN                                0x6
#define _RC3I2C_I2CSLEW_POSITION                            0x6
#define _RC3I2C_I2CSLEW_SIZE                                0x2
#define _RC3I2C_I2CSLEW_LENGTH                              0x2
#define _RC3I2C_I2CSLEW_MASK                                0xC0
#define _RC3I2C_I2CTH0_POSN                                 0x0
#define _RC3I2C_I2CTH0_POSITION                             0x0
#define _RC3I2C_I2CTH0_SIZE                                 0x1
#define _RC3I2C_I2CTH0_LENGTH                               0x1
#define _RC3I2C_I2CTH0_MASK                                 0x1
#define _RC3I2C_I2CTH1_POSN                                 0x1
#define _RC3I2C_I2CTH1_POSITION                             0x1
#define _RC3I2C_I2CTH1_SIZE                                 0x1
#define _RC3I2C_I2CTH1_LENGTH                               0x1
#define _RC3I2C_I2CTH1_MASK                                 0x2
#define _RC3I2C_I2CSLEW0_POSN                               0x6
#define _RC3I2C_I2CSLEW0_POSITION                           0x6
#define _RC3I2C_I2CSLEW0_SIZE                               0x1
#define _RC3I2C_I2CSLEW0_LENGTH                             0x1
#define _RC3I2C_I2CSLEW0_MASK                               0x40
#define _RC3I2C_I2CSLEW1_POSN                               0x7
#define _RC3I2C_I2CSLEW1_POSITION                           0x7
#define _RC3I2C_I2CSLEW1_SIZE                               0x1
#define _RC3I2C_I2CSLEW1_LENGTH                             0x1
#define _RC3I2C_I2CSLEW1_MASK                               0x80

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x285);
#ifndef _LIB_BUILD
asm("RC4I2C equ 0285h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :4;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :4;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :4;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x285);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x2
#define _RC4I2C_SLEW_LENGTH                                 0x2
#define _RC4I2C_SLEW_MASK                                   0xC0
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_SLEW0_POSN                                  0x6
#define _RC4I2C_SLEW0_POSITION                              0x6
#define _RC4I2C_SLEW0_SIZE                                  0x1
#define _RC4I2C_SLEW0_LENGTH                                0x1
#define _RC4I2C_SLEW0_MASK                                  0x40
#define _RC4I2C_SLEW1_POSN                                  0x7
#define _RC4I2C_SLEW1_POSITION                              0x7
#define _RC4I2C_SLEW1_SIZE                                  0x1
#define _RC4I2C_SLEW1_LENGTH                                0x1
#define _RC4I2C_SLEW1_MASK                                  0x80
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x2
#define _RC4I2C_I2CSLEW_LENGTH                              0x2
#define _RC4I2C_I2CSLEW_MASK                                0xC0
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CSLEW0_POSN                               0x6
#define _RC4I2C_I2CSLEW0_POSITION                           0x6
#define _RC4I2C_I2CSLEW0_SIZE                               0x1
#define _RC4I2C_I2CSLEW0_LENGTH                             0x1
#define _RC4I2C_I2CSLEW0_MASK                               0x40
#define _RC4I2C_I2CSLEW1_POSN                               0x7
#define _RC4I2C_I2CSLEW1_POSITION                           0x7
#define _RC4I2C_I2CSLEW1_SIZE                               0x1
#define _RC4I2C_I2CSLEW1_LENGTH                             0x1
#define _RC4I2C_I2CSLEW1_MASK                               0x80

// Register: RB1I2C
#define RB1I2C RB1I2C
extern volatile unsigned char           RB1I2C              __at(0x286);
#ifndef _LIB_BUILD
asm("RB1I2C equ 0286h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RB1I2Cbits_t;
extern volatile RB1I2Cbits_t RB1I2Cbits __at(0x286);
// bitfield macros
#define _RB1I2C_TH_POSN                                     0x0
#define _RB1I2C_TH_POSITION                                 0x0
#define _RB1I2C_TH_SIZE                                     0x2
#define _RB1I2C_TH_LENGTH                                   0x2
#define _RB1I2C_TH_MASK                                     0x3
#define _RB1I2C_PU_POSN                                     0x4
#define _RB1I2C_PU_POSITION                                 0x4
#define _RB1I2C_PU_SIZE                                     0x2
#define _RB1I2C_PU_LENGTH                                   0x2
#define _RB1I2C_PU_MASK                                     0x30
#define _RB1I2C_SLEW_POSN                                   0x6
#define _RB1I2C_SLEW_POSITION                               0x6
#define _RB1I2C_SLEW_SIZE                                   0x2
#define _RB1I2C_SLEW_LENGTH                                 0x2
#define _RB1I2C_SLEW_MASK                                   0xC0
#define _RB1I2C_TH0_POSN                                    0x0
#define _RB1I2C_TH0_POSITION                                0x0
#define _RB1I2C_TH0_SIZE                                    0x1
#define _RB1I2C_TH0_LENGTH                                  0x1
#define _RB1I2C_TH0_MASK                                    0x1
#define _RB1I2C_TH1_POSN                                    0x1
#define _RB1I2C_TH1_POSITION                                0x1
#define _RB1I2C_TH1_SIZE                                    0x1
#define _RB1I2C_TH1_LENGTH                                  0x1
#define _RB1I2C_TH1_MASK                                    0x2
#define _RB1I2C_PU0_POSN                                    0x4
#define _RB1I2C_PU0_POSITION                                0x4
#define _RB1I2C_PU0_SIZE                                    0x1
#define _RB1I2C_PU0_LENGTH                                  0x1
#define _RB1I2C_PU0_MASK                                    0x10
#define _RB1I2C_PU1_POSN                                    0x5
#define _RB1I2C_PU1_POSITION                                0x5
#define _RB1I2C_PU1_SIZE                                    0x1
#define _RB1I2C_PU1_LENGTH                                  0x1
#define _RB1I2C_PU1_MASK                                    0x20
#define _RB1I2C_SLEW0_POSN                                  0x6
#define _RB1I2C_SLEW0_POSITION                              0x6
#define _RB1I2C_SLEW0_SIZE                                  0x1
#define _RB1I2C_SLEW0_LENGTH                                0x1
#define _RB1I2C_SLEW0_MASK                                  0x40
#define _RB1I2C_SLEW1_POSN                                  0x7
#define _RB1I2C_SLEW1_POSITION                              0x7
#define _RB1I2C_SLEW1_SIZE                                  0x1
#define _RB1I2C_SLEW1_LENGTH                                0x1
#define _RB1I2C_SLEW1_MASK                                  0x80
#define _RB1I2C_I2CTH_POSN                                  0x0
#define _RB1I2C_I2CTH_POSITION                              0x0
#define _RB1I2C_I2CTH_SIZE                                  0x2
#define _RB1I2C_I2CTH_LENGTH                                0x2
#define _RB1I2C_I2CTH_MASK                                  0x3
#define _RB1I2C_I2CPU_POSN                                  0x4
#define _RB1I2C_I2CPU_POSITION                              0x4
#define _RB1I2C_I2CPU_SIZE                                  0x2
#define _RB1I2C_I2CPU_LENGTH                                0x2
#define _RB1I2C_I2CPU_MASK                                  0x30
#define _RB1I2C_I2CSLEW_POSN                                0x6
#define _RB1I2C_I2CSLEW_POSITION                            0x6
#define _RB1I2C_I2CSLEW_SIZE                                0x2
#define _RB1I2C_I2CSLEW_LENGTH                              0x2
#define _RB1I2C_I2CSLEW_MASK                                0xC0
#define _RB1I2C_I2CTH0_POSN                                 0x0
#define _RB1I2C_I2CTH0_POSITION                             0x0
#define _RB1I2C_I2CTH0_SIZE                                 0x1
#define _RB1I2C_I2CTH0_LENGTH                               0x1
#define _RB1I2C_I2CTH0_MASK                                 0x1
#define _RB1I2C_I2CTH1_POSN                                 0x1
#define _RB1I2C_I2CTH1_POSITION                             0x1
#define _RB1I2C_I2CTH1_SIZE                                 0x1
#define _RB1I2C_I2CTH1_LENGTH                               0x1
#define _RB1I2C_I2CTH1_MASK                                 0x2
#define _RB1I2C_I2CPU0_POSN                                 0x4
#define _RB1I2C_I2CPU0_POSITION                             0x4
#define _RB1I2C_I2CPU0_SIZE                                 0x1
#define _RB1I2C_I2CPU0_LENGTH                               0x1
#define _RB1I2C_I2CPU0_MASK                                 0x10
#define _RB1I2C_I2CPU1_POSN                                 0x5
#define _RB1I2C_I2CPU1_POSITION                             0x5
#define _RB1I2C_I2CPU1_SIZE                                 0x1
#define _RB1I2C_I2CPU1_LENGTH                               0x1
#define _RB1I2C_I2CPU1_MASK                                 0x20
#define _RB1I2C_I2CSLEW0_POSN                               0x6
#define _RB1I2C_I2CSLEW0_POSITION                           0x6
#define _RB1I2C_I2CSLEW0_SIZE                               0x1
#define _RB1I2C_I2CSLEW0_LENGTH                             0x1
#define _RB1I2C_I2CSLEW0_MASK                               0x40
#define _RB1I2C_I2CSLEW1_POSN                               0x7
#define _RB1I2C_I2CSLEW1_POSITION                           0x7
#define _RB1I2C_I2CSLEW1_SIZE                               0x1
#define _RB1I2C_I2CSLEW1_LENGTH                             0x1
#define _RB1I2C_I2CSLEW1_MASK                               0x80

// Register: RB2I2C
#define RB2I2C RB2I2C
extern volatile unsigned char           RB2I2C              __at(0x287);
#ifndef _LIB_BUILD
asm("RB2I2C equ 0287h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RB2I2Cbits_t;
