garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern volatile I2C2CNTHbits_t I2C2CNTHbits __at(0x2A2);
// bitfield macros
#define _I2C2CNTH_CNT_POSN                                  0x0
#define _I2C2CNTH_CNT_POSITION                              0x0
#define _I2C2CNTH_CNT_SIZE                                  0x8
#define _I2C2CNTH_CNT_LENGTH                                0x8
#define _I2C2CNTH_CNT_MASK                                  0xFF
#define _I2C2CNTH_CNT8_POSN                                 0x0
#define _I2C2CNTH_CNT8_POSITION                             0x0
#define _I2C2CNTH_CNT8_SIZE                                 0x1
#define _I2C2CNTH_CNT8_LENGTH                               0x1
#define _I2C2CNTH_CNT8_MASK                                 0x1
#define _I2C2CNTH_CNT9_POSN                                 0x1
#define _I2C2CNTH_CNT9_POSITION                             0x1
#define _I2C2CNTH_CNT9_SIZE                                 0x1
#define _I2C2CNTH_CNT9_LENGTH                               0x1
#define _I2C2CNTH_CNT9_MASK                                 0x2
#define _I2C2CNTH_CNT10_POSN                                0x2
#define _I2C2CNTH_CNT10_POSITION                            0x2
#define _I2C2CNTH_CNT10_SIZE                                0x1
#define _I2C2CNTH_CNT10_LENGTH                              0x1
#define _I2C2CNTH_CNT10_MASK                                0x4
#define _I2C2CNTH_CNT11_POSN                                0x3
#define _I2C2CNTH_CNT11_POSITION                            0x3
#define _I2C2CNTH_CNT11_SIZE                                0x1
#define _I2C2CNTH_CNT11_LENGTH                              0x1
#define _I2C2CNTH_CNT11_MASK                                0x8
#define _I2C2CNTH_CNT12_POSN                                0x4
#define _I2C2CNTH_CNT12_POSITION                            0x4
#define _I2C2CNTH_CNT12_SIZE                                0x1
#define _I2C2CNTH_CNT12_LENGTH                              0x1
#define _I2C2CNTH_CNT12_MASK                                0x10
#define _I2C2CNTH_CNT13_POSN                                0x5
#define _I2C2CNTH_CNT13_POSITION                            0x5
#define _I2C2CNTH_CNT13_SIZE                                0x1
#define _I2C2CNTH_CNT13_LENGTH                              0x1
#define _I2C2CNTH_CNT13_MASK                                0x20
#define _I2C2CNTH_CNT14_POSN                                0x6
#define _I2C2CNTH_CNT14_POSITION                            0x6
#define _I2C2CNTH_CNT14_SIZE                                0x1
#define _I2C2CNTH_CNT14_LENGTH                              0x1
#define _I2C2CNTH_CNT14_MASK                                0x40
#define _I2C2CNTH_CNT15_POSN                                0x7
#define _I2C2CNTH_CNT15_POSITION                            0x7
#define _I2C2CNTH_CNT15_SIZE                                0x1
#define _I2C2CNTH_CNT15_LENGTH                              0x1
#define _I2C2CNTH_CNT15_MASK                                0x80
#define _I2C2CNTH_I2C2CNT_POSN                              0x0
#define _I2C2CNTH_I2C2CNT_POSITION                          0x0
#define _I2C2CNTH_I2C2CNT_SIZE                              0x8
#define _I2C2CNTH_I2C2CNT_LENGTH                            0x8
#define _I2C2CNTH_I2C2CNT_MASK                              0xFF
#define _I2C2CNTH_I2C2CNT8_POSN                             0x0
#define _I2C2CNTH_I2C2CNT8_POSITION                         0x0
#define _I2C2CNTH_I2C2CNT8_SIZE                             0x1
#define _I2C2CNTH_I2C2CNT8_LENGTH                           0x1
#define _I2C2CNTH_I2C2CNT8_MASK                             0x1
#define _I2C2CNTH_I2C2CNT9_POSN                             0x1
#define _I2C2CNTH_I2C2CNT9_POSITION                         0x1
#define _I2C2CNTH_I2C2CNT9_SIZE                             0x1
#define _I2C2CNTH_I2C2CNT9_LENGTH                           0x1
#define _I2C2CNTH_I2C2CNT9_MASK                             0x2
#define _I2C2CNTH_I2C2CNT10_POSN                            0x2
#define _I2C2CNTH_I2C2CNT10_POSITION                        0x2
#define _I2C2CNTH_I2C2CNT10_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT10_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT10_MASK                            0x4
#define _I2C2CNTH_I2C2CNT11_POSN                            0x3
#define _I2C2CNTH_I2C2CNT11_POSITION                        0x3
#define _I2C2CNTH_I2C2CNT11_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT11_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT11_MASK                            0x8
#define _I2C2CNTH_I2C2CNT12_POSN                            0x4
#define _I2C2CNTH_I2C2CNT12_POSITION                        0x4
#define _I2C2CNTH_I2C2CNT12_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT12_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT12_MASK                            0x10
#define _I2C2CNTH_I2C2CNT13_POSN                            0x5
#define _I2C2CNTH_I2C2CNT13_POSITION                        0x5
#define _I2C2CNTH_I2C2CNT13_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT13_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT13_MASK                            0x20
#define _I2C2CNTH_I2C2CNT14_POSN                            0x6
#define _I2C2CNTH_I2C2CNT14_POSITION                        0x6
#define _I2C2CNTH_I2C2CNT14_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT14_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT14_MASK                            0x40
#define _I2C2CNTH_I2C2CNT15_POSN                            0x7
#define _I2C2CNTH_I2C2CNT15_POSITION                        0x7
#define _I2C2CNTH_I2C2CNT15_SIZE                            0x1
#define _I2C2CNTH_I2C2CNT15_LENGTH                          0x1
#define _I2C2CNTH_I2C2CNT15_MASK                            0x80

// Register: I2C2ADB0
#define I2C2ADB0 I2C2ADB0
extern volatile unsigned char           I2C2ADB0            __at(0x2A3);
#ifndef _LIB_BUILD
asm("I2C2ADB0 equ 02A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C2ADB0bits_t;
extern volatile I2C2ADB0bits_t I2C2ADB0bits __at(0x2A3);
// bitfield macros
#define _I2C2ADB0_ADB_POSN                                  0x0
#define _I2C2ADB0_ADB_POSITION                              0x0
#define _I2C2ADB0_ADB_SIZE                                  0x8
#define _I2C2ADB0_ADB_LENGTH                                0x8
#define _I2C2ADB0_ADB_MASK                                  0xFF

