garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern volatile U1CON2bits_t U1CON2bits __at(0x2C2);
// bitfield macros
#define _U1CON2_FLO_POSN                                    0x0
#define _U1CON2_FLO_POSITION                                0x0
#define _U1CON2_FLO_SIZE                                    0x2
#define _U1CON2_FLO_LENGTH                                  0x2
#define _U1CON2_FLO_MASK                                    0x3
#define _U1CON2_TXPOL_POSN                                  0x2
#define _U1CON2_TXPOL_POSITION                              0x2
#define _U1CON2_TXPOL_SIZE                                  0x1
#define _U1CON2_TXPOL_LENGTH                                0x1
#define _U1CON2_TXPOL_MASK                                  0x4
#define _U1CON2_C0EN_POSN                                   0x3
#define _U1CON2_C0EN_POSITION                               0x3
#define _U1CON2_C0EN_SIZE                                   0x1
#define _U1CON2_C0EN_LENGTH                                 0x1
#define _U1CON2_C0EN_MASK                                   0x8
#define _U1CON2_STP_POSN                                    0x4
#define _U1CON2_STP_POSITION                                0x4
#define _U1CON2_STP_SIZE                                    0x2
#define _U1CON2_STP_LENGTH                                  0x2
#define _U1CON2_STP_MASK                                    0x30
#define _U1CON2_RXPOL_POSN                                  0x6
#define _U1CON2_RXPOL_POSITION                              0x6
#define _U1CON2_RXPOL_SIZE                                  0x1
#define _U1CON2_RXPOL_LENGTH                                0x1
#define _U1CON2_RXPOL_MASK                                  0x40
#define _U1CON2_RUNOVF_POSN                                 0x7
#define _U1CON2_RUNOVF_POSITION                             0x7
#define _U1CON2_RUNOVF_SIZE                                 0x1
#define _U1CON2_RUNOVF_LENGTH                               0x1
#define _U1CON2_RUNOVF_MASK                                 0x80
#define _U1CON2_FLO0_POSN                                   0x0
#define _U1CON2_FLO0_POSITION                               0x0
#define _U1CON2_FLO0_SIZE                                   0x1
#define _U1CON2_FLO0_LENGTH                                 0x1
#define _U1CON2_FLO0_MASK                                   0x1
#define _U1CON2_FLO1_POSN                                   0x1
#define _U1CON2_FLO1_POSITION                               0x1
#define _U1CON2_FLO1_SIZE                                   0x1
#define _U1CON2_FLO1_LENGTH                                 0x1
#define _U1CON2_FLO1_MASK                                   0x2
#define _U1CON2_STP0_POSN                                   0x4
#define _U1CON2_STP0_POSITION                               0x4
#define _U1CON2_STP0_SIZE                                   0x1
#define _U1CON2_STP0_LENGTH                                 0x1
#define _U1CON2_STP0_MASK                                   0x10
#define _U1CON2_STP1_POSN                                   0x5
#define _U1CON2_STP1_POSITION                               0x5
#define _U1CON2_STP1_SIZE                                   0x1
#define _U1CON2_STP1_LENGTH                                 0x1
#define _U1CON2_STP1_MASK                                   0x20
#define _U1CON2_U1FLO_POSN                                  0x0
#define _U1CON2_U1FLO_POSITION                              0x0
#define _U1CON2_U1FLO_SIZE                                  0x2
#define _U1CON2_U1FLO_LENGTH                                0x2
#define _U1CON2_U1FLO_MASK                                  0x3
#define _U1CON2_U1TXPOL_POSN                                0x2
#define _U1CON2_U1TXPOL_POSITION                            0x2
#define _U1CON2_U1TXPOL_SIZE                                0x1
#define _U1CON2_U1TXPOL_LENGTH                              0x1
#define _U1CON2_U1TXPOL_MASK                                0x4
#define _U1CON2_U1C0EN_POSN                                 0x3
#define _U1CON2_U1C0EN_POSITION                             0x3
#define _U1CON2_U1C0EN_SIZE                                 0x1
#define _U1CON2_U1C0EN_LENGTH                               0x1
#define _U1CON2_U1C0EN_MASK                                 0x8
#define _U1CON2_U1STP_POSN                                  0x4
#define _U1CON2_U1STP_POSITION                              0x4
#define _U1CON2_U1STP_SIZE                                  0x2
#define _U1CON2_U1STP_LENGTH                                0x2
#define _U1CON2_U1STP_MASK                                  0x30
#define _U1CON2_U1RXPOL_POSN                                0x6
#define _U1CON2_U1RXPOL_POSITION                            0x6
#define _U1CON2_U1RXPOL_SIZE                                0x1
#define _U1CON2_U1RXPOL_LENGTH                              0x1
#define _U1CON2_U1RXPOL_MASK                                0x40
#define _U1CON2_U1RUNOVF_POSN                               0x7
#define _U1CON2_U1RUNOVF_POSITION                           0x7
#define _U1CON2_U1RUNOVF_SIZE                               0x1
#define _U1CON2_U1RUNOVF_LENGTH                             0x1
#define _U1CON2_U1RUNOVF_MASK                               0x80
#define _U1CON2_U1FLO0_POSN                                 0x0
#define _U1CON2_U1FLO0_POSITION                             0x0
#define _U1CON2_U1FLO0_SIZE                                 0x1
#define _U1CON2_U1FLO0_LENGTH                               0x1
#define _U1CON2_U1FLO0_MASK                                 0x1
#define _U1CON2_U1FLO1_POSN                                 0x1
#define _U1CON2_U1FLO1_POSITION                             0x1
#define _U1CON2_U1FLO1_SIZE                                 0x1
#define _U1CON2_U1FLO1_LENGTH                               0x1
#define _U1CON2_U1FLO1_MASK                                 0x2
#define _U1CON2_U1STP0_POSN                                 0x4
#define _U1CON2_U1STP0_POSITION                             0x4
#define _U1CON2_U1STP0_SIZE                                 0x1
#define _U1CON2_U1STP0_LENGTH                               0x1
#define _U1CON2_U1STP0_MASK                                 0x10
#define _U1CON2_U1STP1_POSN                                 0x5
#define _U1CON2_U1STP1_POSITION                             0x5
#define _U1CON2_U1STP1_SIZE                                 0x1
#define _U1CON2_U1STP1_LENGTH                               0x1
#define _U1CON2_U1STP1_MASK                                 0x20

// Register: U1BRG
#define U1BRG U1BRG
extern volatile unsigned short          U1BRG               __at(0x2C3);
#ifndef _LIB_BUILD
asm("U1BRG equ 02C3h");
#endif

// Register: U1BRGL
#define U1BRGL U1BRGL
extern volatile unsigned char           U1BRGL              __at(0x2C3);
#ifndef _LIB_BUILD
asm("U1BRGL equ 02C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U1BRGLbits_t;
extern volatile U1BRGLbits_t U1BRGLbits __at(0x2C3);
// bitfield macros
#define _U1BRGL_BRGL_POSN                                   0x0
#define _U1BRGL_BRGL_POSITION                               0x0
#define _U1BRGL_BRGL_SIZE                                   0x8
#define _U1BRGL_BRGL_LENGTH                                 0x8
#define _U1BRGL_BRGL_MASK                                   0xFF

// Register: U1BRGH
#define U1BRGH U1BRGH
extern volatile unsigned char           U1BRGH              __at(0x2C4);
#ifndef _LIB_BUILD
asm("U1BRGH equ 02C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U1BRGHbits_t;
extern volatile U1BRGHbits_t U1BRGHbits __at(0x2C4);
// bitfield macros
#define _U1BRGH_BRGH_POSN                                   0x0
#define _U1BRGH_BRGH_POSITION                               0x0
#define _U1BRGH_BRGH_SIZE                                   0x8
#define _U1BRGH_BRGH_LENGTH                                 0x8
#define _U1BRGH_BRGH_MASK                                   0xFF

// Register: U1FIFO
#define U1FIFO U1FIFO
extern volatile unsigned char           U1FIFO              __at(0x2C5);
#ifndef _LIB_BUILD
asm("U1FIFO equ 02C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U1RXBF                 :1;
        unsigned U1RXBE                 :1;
        unsigned U1XON                  :1;
        unsigned U1RXIDL                :1;
        unsigned U1TXBF                 :1;
        unsigned U1TXBE                 :1;
        unsigned U1STPMD                :1;
        unsigned U1TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U1RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U1FIFObits_t;
extern volatile U1FIFObits_t U1FIFObits __at(0x2C5);
// bitfield macros
#define _U1FIFO_RXBF_POSN                                   0x0
#define _U1FIFO_RXBF_POSITION                               0x0
#define _U1FIFO_RXBF_SIZE                                   0x1
#define _U1FIFO_RXBF_LENGTH                                 0x1
#define _U1FIFO_RXBF_MASK                                   0x1
#define _U1FIFO_RXBE_POSN                                   0x1
#define _U1FIFO_RXBE_POSITION                               0x1
#define _U1FIFO_RXBE_SIZE                                   0x1
#define _U1FIFO_RXBE_LENGTH                                 0x1
#define _U1FIFO_RXBE_MASK                                   0x2
#define _U1FIFO_XON_POSN                                    0x2
#define _U1FIFO_XON_POSITION                                0x2
#define _U1FIFO_XON_SIZE                                    0x1
#define _U1FIFO_XON_LENGTH                                  0x1
#define _U1FIFO_XON_MASK                                    0x4
#define _U1FIFO_RXIDL_POSN                                  0x3
#define _U1FIFO_RXIDL_POSITION                              0x3
#define _U1FIFO_RXIDL_SIZE                                  0x1
#define _U1FIFO_RXIDL_LENGTH                                0x1
#define _U1FIFO_RXIDL_MASK                                  0x8
#define _U1FIFO_TXBF_POSN                                   0x4
#define _U1FIFO_TXBF_POSITION                               0x4
#define _U1FIFO_TXBF_SIZE                                   0x1
#define _U1FIFO_TXBF_LENGTH                                 0x1
#define _U1FIFO_TXBF_MASK                                   0x10
#define _U1FIFO_TXBE_POSN                                   0x5
#define _U1FIFO_TXBE_POSITION                               0x5
#define _U1FIFO_TXBE_SIZE                                   0x1
#define _U1FIFO_TXBE_LENGTH                                 0x1
#define _U1FIFO_TXBE_MASK                                   0x20
#define _U1FIFO_STPMD_POSN                                  0x6
#define _U1FIFO_STPMD_POSITION                              0x6
#define _U1FIFO_STPMD_SIZE                                  0x1
#define _U1FIFO_STPMD_LENGTH                                0x1
#define _U1FIFO_STPMD_MASK                                  0x40
#define _U1FIFO_TXWRE_POSN                                  0x7
#define _U1FIFO_TXWRE_POSITION                              0x7
#define _U1FIFO_TXWRE_SIZE                                  0x1
#define _U1FIFO_TXWRE_LENGTH                                0x1
#define _U1FIFO_TXWRE_MASK                                  0x80
#define _U1FIFO_U1RXBF_POSN                                 0x0
#define _U1FIFO_U1RXBF_POSITION                             0x0
#define _U1FIFO_U1RXBF_SIZE                                 0x1
#define _U1FIFO_U1RXBF_LENGTH                               0x1
#define _U1FIFO_U1RXBF_MASK                                 0x1
#define _U1FIFO_U1RXBE_POSN                                 0x1
#define _U1FIFO_U1RXBE_POSITION                             0x1
#define _U1FIFO_U1RXBE_SIZE                                 0x1
#define _U1FIFO_U1RXBE_LENGTH                               0x1
#define _U1FIFO_U1RXBE_MASK                                 0x2
#define _U1FIFO_U1XON_POSN                                  0x2
#define _U1FIFO_U1XON_POSITION                              0x2
#define _U1FIFO_U1XON_SIZE                                  0x1
#define _U1FIFO_U1XON_LENGTH                                0x1
#define _U1FIFO_U1XON_MASK                                  0x4
#define _U1FIFO_U1RXIDL_POSN                                0x3
#define _U1FIFO_U1RXIDL_POSITION                            0x3
#define _U1FIFO_U1RXIDL_SIZE                                0x1
#define _U1FIFO_U1RXIDL_LENGTH                              0x1
#define _U1FIFO_U1RXIDL_MASK                                0x8
#define _U1FIFO_U1TXBF_POSN                                 0x4
#define _U1FIFO_U1TXBF_POSITION                             0x4
#define _U1FIFO_U1TXBF_SIZE                                 0x1
#define _U1FIFO_U1TXBF_LENGTH                               0x1
#define _U1FIFO_U1TXBF_MASK                                 0x10
#define _U1FIFO_U1TXBE_POSN                                 0x5
#define _U1FIFO_U1TXBE_POSITION                             0x5
#define _U1FIFO_U1TXBE_SIZE                                 0x1
#define _U1FIFO_U1TXBE_LENGTH                               0x1
#define _U1FIFO_U1TXBE_MASK                                 0x20
#define _U1FIFO_U1STPMD_POSN                                0x6
#define _U1FIFO_U1STPMD_POSITION                            0x6
#define _U1FIFO_U1STPMD_SIZE                                0x1
#define _U1FIFO_U1STPMD_LENGTH                              0x1
#define _U1FIFO_U1STPMD_MASK                                0x40
#define _U1FIFO_U1TXWRE_POSN                                0x7
#define _U1FIFO_U1TXWRE_POSITION                            0x7
#define _U1FIFO_U1TXWRE_SIZE                                0x1
#define _U1FIFO_U1TXWRE_LENGTH                              0x1
#define _U1FIFO_U1TXWRE_MASK                                0x80
#define _U1FIFO_U1RCIDL_POSN                                0x3
#define _U1FIFO_U1RCIDL_POSITION                            0x3
#define _U1FIFO_U1RCIDL_SIZE                                0x1
#define _U1FIFO_U1RCIDL_LENGTH                              0x1
#define _U1FIFO_U1RCIDL_MASK                                0x8
#define _U1FIFO_RCIDL_POSN                                  0x3
#define _U1FIFO_RCIDL_POSITION                              0x3
#define _U1FIFO_RCIDL_SIZE                                  0x1
#define _U1FIFO_RCIDL_LENGTH                                0x1
#define _U1FIFO_RCIDL_MASK                                  0x8

// Register: U1UIR
#define U1UIR U1UIR
extern volatile unsigned char           U1UIR               __at(0x2C6);
#ifndef _LIB_BUILD
asm("U1UIR equ 02C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U1ABDIE                :1;
        unsigned                        :3;
        unsigned U1ABDIF                :1;
        unsigned U1WUIF                 :1;
    };
} U1UIRbits_t;
extern volatile U1UIRbits_t U1UIRbits __at(0x2C6);
// bitfield macros
#define _U1UIR_ABDIE_POSN                                   0x2
#define _U1UIR_ABDIE_POSITION                               0x2
#define _U1UIR_ABDIE_SIZE                                   0x1
#define _U1UIR_ABDIE_LENGTH                                 0x1
#define _U1UIR_ABDIE_MASK                                   0x4
#define _U1UIR_ABDIF_POSN                                   0x6
#define _U1UIR_ABDIF_POSITION                               0x6
#define _U1UIR_ABDIF_SIZE                                   0x1
#define _U1UIR_ABDIF_LENGTH                                 0x1
#define _U1UIR_ABDIF_MASK                                   0x40
#define _U1UIR_WUIF_POSN                                    0x7
#define _U1UIR_WUIF_POSITION                                0x7
#define _U1UIR_WUIF_SIZE                                    0x1
#define _U1UIR_WUIF_LENGTH                                  0x1
#define _U1UIR_WUIF_MASK                                    0x80
#define _U1UIR_U1ABDIE_POSN                                 0x2
#define _U1UIR_U1ABDIE_POSITION                             0x2
#define _U1UIR_U1ABDIE_SIZE                                 0x1
#define _U1UIR_U1ABDIE_LENGTH                               0x1
#define _U1UIR_U1ABDIE_MASK                                 0x4
#define _U1UIR_U1ABDIF_POSN                                 0x6
#define _U1UIR_U1ABDIF_POSITION                             0x6
#define _U1UIR_U1ABDIF_SIZE                                 0x1
#define _U1UIR_U1ABDIF_LENGTH                               0x1
#define _U1UIR_U1ABDIF_MASK                                 0x40
#define _U1UIR_U1WUIF_POSN                                  0x7
#define _U1UIR_U1WUIF_POSITION                              0x7
#define _U1UIR_U1WUIF_SIZE                                  0x1
#define _U1UIR_U1WUIF_LENGTH                                0x1
#define _U1UIR_U1WUIF_MASK                                  0x80

