garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
extern volatile unsigned char           PCLATU_SHAD         __at(0x37B);
#ifndef _LIB_BUILD
asm("PCLATU_SHAD equ 037Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCU                    :5;
    };
} PCLATU_SHADbits_t;
extern volatile PCLATU_SHADbits_t PCLATU_SHADbits __at(0x37B);
// bitfield macros
#define _PCLATU_SHAD_PCU_POSN                               0x0
#define _PCLATU_SHAD_PCU_POSITION                           0x0
#define _PCLATU_SHAD_PCU_SIZE                               0x5
#define _PCLATU_SHAD_PCU_LENGTH                             0x5
#define _PCLATU_SHAD_PCU_MASK                               0x1F

// Register: FSR0SH
#define FSR0SH FSR0SH
extern volatile unsigned short          FSR0SH              __at(0x37C);
#ifndef _LIB_BUILD
asm("FSR0SH equ 037Ch");
#endif

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
extern volatile unsigned char           FSR0L_SHAD          __at(0x37C);
#ifndef _LIB_BUILD
asm("FSR0L_SHAD equ 037Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L                  :8;
    };
} FSR0L_SHADbits_t;
extern volatile FSR0L_SHADbits_t FSR0L_SHADbits __at(0x37C);
// bitfield macros
#define _FSR0L_SHAD_FSR0L_POSN                              0x0
#define _FSR0L_SHAD_FSR0L_POSITION                          0x0
#define _FSR0L_SHAD_FSR0L_SIZE                              0x8
#define _FSR0L_SHAD_FSR0L_LENGTH                            0x8
#define _FSR0L_SHAD_FSR0L_MASK                              0xFF

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
extern volatile unsigned char           FSR0H_SHAD          __at(0x37D);
#ifndef _LIB_BUILD
asm("FSR0H_SHAD equ 037Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H                  :6;
    };
} FSR0H_SHADbits_t;
extern volatile FSR0H_SHADbits_t FSR0H_SHADbits __at(0x37D);
// bitfield macros
#define _FSR0H_SHAD_FSR0H_POSN                              0x0
#define _FSR0H_SHAD_FSR0H_POSITION                          0x0
#define _FSR0H_SHAD_FSR0H_SIZE                              0x6
#define _FSR0H_SHAD_FSR0H_LENGTH                            0x6
#define _FSR0H_SHAD_FSR0H_MASK                              0x3F

// Register: FSR1SH
#define FSR1SH FSR1SH
extern volatile unsigned short          FSR1SH              __at(0x37E);
#ifndef _LIB_BUILD
asm("FSR1SH equ 037Eh");
#endif

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
extern volatile unsigned char           FSR1L_SHAD          __at(0x37E);
#ifndef _LIB_BUILD
asm("FSR1L_SHAD equ 037Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1L                  :8;
    };
} FSR1L_SHADbits_t;
extern volatile FSR1L_SHADbits_t FSR1L_SHADbits __at(0x37E);
// bitfield macros
#define _FSR1L_SHAD_FSR1L_POSN                              0x0
#define _FSR1L_SHAD_FSR1L_POSITION                          0x0
#define _FSR1L_SHAD_FSR1L_SIZE                              0x8
#define _FSR1L_SHAD_FSR1L_LENGTH                            0x8
#define _FSR1L_SHAD_FSR1L_MASK                              0xFF

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
extern volatile unsigned char           FSR1H_SHAD          __at(0x37F);
#ifndef _LIB_BUILD
asm("FSR1H_SHAD equ 037Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1H                  :6;
    };
} FSR1H_SHADbits_t;
extern volatile FSR1H_SHADbits_t FSR1H_SHADbits __at(0x37F);
// bitfield macros
#define _FSR1H_SHAD_FSR1H_POSN                              0x0
#define _FSR1H_SHAD_FSR1H_POSITION                          0x0
#define _FSR1H_SHAD_FSR1H_SIZE                              0x6
#define _FSR1H_SHAD_FSR1H_LENGTH                            0x6
#define _FSR1H_SHAD_FSR1H_MASK                              0x3F

// Register: FSR2SH
#define FSR2SH FSR2SH
extern volatile unsigned short          FSR2SH              __at(0x380);
#ifndef _LIB_BUILD
asm("FSR2SH equ 0380h");
#endif

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
extern volatile unsigned char           FSR2L_SHAD          __at(0x380);
#ifndef _LIB_BUILD
asm("FSR2L_SHAD equ 0380h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2L_SHADbits_t;
extern volatile FSR2L_SHADbits_t FSR2L_SHADbits __at(0x380);
// bitfield macros
#define _FSR2L_SHAD_FSR2L_POSN                              0x0
#define _FSR2L_SHAD_FSR2L_POSITION                          0x0
#define _FSR2L_SHAD_FSR2L_SIZE                              0x8
#define _FSR2L_SHAD_FSR2L_LENGTH                            0x8
#define _FSR2L_SHAD_FSR2L_MASK                              0xFF

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
extern volatile unsigned char           FSR2H_SHAD          __at(0x381);
#ifndef _LIB_BUILD
asm("FSR2H_SHAD equ 0381h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2H_SHADbits_t;
extern volatile FSR2H_SHADbits_t FSR2H_SHADbits __at(0x381);
// bitfield macros
#define _FSR2H_SHAD_FSR2H_POSN                              0x0
#define _FSR2H_SHAD_FSR2H_POSITION                          0x0
#define _FSR2H_SHAD_FSR2H_SIZE                              0x6
#define _FSR2H_SHAD_FSR2H_LENGTH                            0x6
#define _FSR2H_SHAD_FSR2H_MASK                              0x3F

// Register: PRODSH
#define PRODSH PRODSH
extern volatile unsigned short          PRODSH              __at(0x382);
#ifndef _LIB_BUILD
asm("PRODSH equ 0382h");
#endif

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
extern volatile unsigned char           PRODL_SHAD          __at(0x382);
#ifndef _LIB_BUILD
asm("PRODL_SHAD equ 0382h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODL                  :8;
    };
} PRODL_SHADbits_t;
extern volatile PRODL_SHADbits_t PRODL_SHADbits __at(0x382);
// bitfield macros
#define _PRODL_SHAD_PRODL_POSN                              0x0
#define _PRODL_SHAD_PRODL_POSITION                          0x0
#define _PRODL_SHAD_PRODL_SIZE                              0x8
#define _PRODL_SHAD_PRODL_LENGTH                            0x8
#define _PRODL_SHAD_PRODL_MASK                              0xFF

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
extern volatile unsigned char           PRODH_SHAD          __at(0x383);
#ifndef _LIB_BUILD
asm("PRODH_SHAD equ 0383h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODH                  :8;
    };
} PRODH_SHADbits_t;
extern volatile PRODH_SHADbits_t PRODH_SHADbits __at(0x383);
// bitfield macros
#define _PRODH_SHAD_PRODH_POSN                              0x0
#define _PRODH_SHAD_PRODH_POSITION                          0x0
#define _PRODH_SHAD_PRODH_SIZE                              0x8
#define _PRODH_SHAD_PRODH_LENGTH                            0x8
#define _PRODH_SHAD_PRODH_MASK                              0xFF

// Register: TU16ACON0
#define TU16ACON0 TU16ACON0
extern volatile unsigned char           TU16ACON0           __at(0x39D);
#ifndef _LIB_BUILD
asm("TU16ACON0 equ 039Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIE                    :1;
        unsigned ZIE                    :1;
        unsigned PRIE                   :1;
        unsigned RDSEL                  :1;
        unsigned OPOL                   :1;
        unsigned OM                     :1;
        unsigned CPOL                   :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned TU16ACIE               :1;
        unsigned TU16AZIE               :1;
        unsigned TU16APRIE              :1;
        unsigned TU16ARDSEL             :1;
        unsigned TU16AOPOL              :1;
        unsigned TU16AOM                :1;
        unsigned TU16ACPOL              :1;
        unsigned TU16AON                :1;
    };
} TU16ACON0bits_t;
extern volatile TU16ACON0bits_t TU16ACON0bits __at(0x39D);
// bitfield macros
#define _TU16ACON0_CIE_POSN                                 0x0
#define _TU16ACON0_CIE_POSITION                             0x0
#define _TU16ACON0_CIE_SIZE                                 0x1
#define _TU16ACON0_CIE_LENGTH                               0x1
#define _TU16ACON0_CIE_MASK                                 0x1
#define _TU16ACON0_ZIE_POSN                                 0x1
#define _TU16ACON0_ZIE_POSITION                             0x1
#define _TU16ACON0_ZIE_SIZE                                 0x1
#define _TU16ACON0_ZIE_LENGTH                               0x1
#define _TU16ACON0_ZIE_MASK                                 0x2
#define _TU16ACON0_PRIE_POSN                                0x2
#define _TU16ACON0_PRIE_POSITION                            0x2
#define _TU16ACON0_PRIE_SIZE                                0x1
#define _TU16ACON0_PRIE_LENGTH                              0x1
#define _TU16ACON0_PRIE_MASK                                0x4
#define _TU16ACON0_RDSEL_POSN                               0x3
#define _TU16ACON0_RDSEL_POSITION                           0x3
#define _TU16ACON0_RDSEL_SIZE                               0x1
#define _TU16ACON0_RDSEL_LENGTH                             0x1
#define _TU16ACON0_RDSEL_MASK                               0x8
#define _TU16ACON0_OPOL_POSN                                0x4
#define _TU16ACON0_OPOL_POSITION                            0x4
#define _TU16ACON0_OPOL_SIZE                                0x1
#define _TU16ACON0_OPOL_LENGTH                              0x1
#define _TU16ACON0_OPOL_MASK                                0x10
#define _TU16ACON0_OM_POSN                                  0x5
#define _TU16ACON0_OM_POSITION                              0x5
#define _TU16ACON0_OM_SIZE                                  0x1
#define _TU16ACON0_OM_LENGTH                                0x1
#define _TU16ACON0_OM_MASK                                  0x20
#define _TU16ACON0_CPOL_POSN                                0x6
#define _TU16ACON0_CPOL_POSITION                            0x6
#define _TU16ACON0_CPOL_SIZE                                0x1
#define _TU16ACON0_CPOL_LENGTH                              0x1
#define _TU16ACON0_CPOL_MASK                                0x40
#define _TU16ACON0_ON_POSN                                  0x7
#define _TU16ACON0_ON_POSITION                              0x7
#define _TU16ACON0_ON_SIZE                                  0x1
#define _TU16ACON0_ON_LENGTH                                0x1
#define _TU16ACON0_ON_MASK                                  0x80
#define _TU16ACON0_TU16ACIE_POSN                            0x0
#define _TU16ACON0_TU16ACIE_POSITION                        0x0
#define _TU16ACON0_TU16ACIE_SIZE                            0x1
#define _TU16ACON0_TU16ACIE_LENGTH                          0x1
#define _TU16ACON0_TU16ACIE_MASK                            0x1
#define _TU16ACON0_TU16AZIE_POSN                            0x1
#define _TU16ACON0_TU16AZIE_POSITION                        0x1
#define _TU16ACON0_TU16AZIE_SIZE                            0x1
#define _TU16ACON0_TU16AZIE_LENGTH                          0x1
#define _TU16ACON0_TU16AZIE_MASK                            0x2
#define _TU16ACON0_TU16APRIE_POSN                           0x2
#define _TU16ACON0_TU16APRIE_POSITION                       0x2
#define _TU16ACON0_TU16APRIE_SIZE                           0x1
#define _TU16ACON0_TU16APRIE_LENGTH                         0x1
#define _TU16ACON0_TU16APRIE_MASK                           0x4
#define _TU16ACON0_TU16ARDSEL_POSN                          0x3
#define _TU16ACON0_TU16ARDSEL_POSITION                      0x3
#define _TU16ACON0_TU16ARDSEL_SIZE                          0x1
#define _TU16ACON0_TU16ARDSEL_LENGTH                        0x1
#define _TU16ACON0_TU16ARDSEL_MASK                          0x8
#define _TU16ACON0_TU16AOPOL_POSN                           0x4
#define _TU16ACON0_TU16AOPOL_POSITION                       0x4
#define _TU16ACON0_TU16AOPOL_SIZE                           0x1
#define _TU16ACON0_TU16AOPOL_LENGTH                         0x1
#define _TU16ACON0_TU16AOPOL_MASK                           0x10
#define _TU16ACON0_TU16AOM_POSN                             0x5
#define _TU16ACON0_TU16AOM_POSITION                         0x5
#define _TU16ACON0_TU16AOM_SIZE                             0x1
#define _TU16ACON0_TU16AOM_LENGTH                           0x1
#define _TU16ACON0_TU16AOM_MASK                             0x20
#define _TU16ACON0_TU16ACPOL_POSN                           0x6
#define _TU16ACON0_TU16ACPOL_POSITION                       0x6
#define _TU16ACON0_TU16ACPOL_SIZE                           0x1
#define _TU16ACON0_TU16ACPOL_LENGTH                         0x1
#define _TU16ACON0_TU16ACPOL_MASK                           0x40
#define _TU16ACON0_TU16AON_POSN                             0x7
#define _TU16ACON0_TU16AON_POSITION                         0x7
#define _TU16ACON0_TU16AON_SIZE                             0x1
#define _TU16ACON0_TU16AON_LENGTH                           0x1
#define _TU16ACON0_TU16AON_MASK                             0x80

// Register: TU16ACON1
#define TU16ACON1 TU16ACON1
extern volatile unsigned char           TU16ACON1           __at(0x39E);
#ifndef _LIB_BUILD
asm("TU16ACON1 equ 039Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIF                    :1;
        unsigned ZIF                    :1;
        unsigned PRIF                   :1;
        unsigned CAPT                   :1;
        unsigned LIMIT                  :1;
        unsigned CLR                    :1;
        unsigned OSEN                   :1;
        unsigned RUN                    :1;
    };
    struct {
        unsigned TU16ACIF               :1;
        unsigned TU16AZIF               :1;
        unsigned TU16APRIF              :1;
        unsigned TU16ACAPT              :1;
        unsigned TU16ALIMIT             :1;
        unsigned TU16ACLR               :1;
        unsigned TMRAOSEN               :1;
        unsigned TU16ARUN               :1;
    };
} TU16ACON1bits_t;
extern volatile TU16ACON1bits_t TU16ACON1bits __at(0x39E);
// bitfield macros
#define _TU16ACON1_CIF_POSN                                 0x0
#define _TU16ACON1_CIF_POSITION                             0x0
#define _TU16ACON1_CIF_SIZE                                 0x1
#define _TU16ACON1_CIF_LENGTH                               0x1
#define _TU16ACON1_CIF_MASK                                 0x1
#define _TU16ACON1_ZIF_POSN                                 0x1
#define _TU16ACON1_ZIF_POSITION                             0x1
#define _TU16ACON1_ZIF_SIZE                                 0x1
#define _TU16ACON1_ZIF_LENGTH                               0x1
#define _TU16ACON1_ZIF_MASK                                 0x2
#define _TU16ACON1_PRIF_POSN                                0x2
#define _TU16ACON1_PRIF_POSITION                            0x2
#define _TU16ACON1_PRIF_SIZE                                0x1
#define _TU16ACON1_PRIF_LENGTH                              0x1
#define _TU16ACON1_PRIF_MASK                                0x4
#define _TU16ACON1_CAPT_POSN                                0x3
#define _TU16ACON1_CAPT_POSITION                            0x3
#define _TU16ACON1_CAPT_SIZE                                0x1
#define _TU16ACON1_CAPT_LENGTH                              0x1
#define _TU16ACON1_CAPT_MASK                                0x8
#define _TU16ACON1_LIMIT_POSN                               0x4
#define _TU16ACON1_LIMIT_POSITION                           0x4
#define _TU16ACON1_LIMIT_SIZE                               0x1
#define _TU16ACON1_LIMIT_LENGTH                             0x1
#define _TU16ACON1_LIMIT_MASK                               0x10
#define _TU16ACON1_CLR_POSN                                 0x5
#define _TU16ACON1_CLR_POSITION                             0x5
#define _TU16ACON1_CLR_SIZE                                 0x1
#define _TU16ACON1_CLR_LENGTH                               0x1
#define _TU16ACON1_CLR_MASK                                 0x20
#define _TU16ACON1_OSEN_POSN                                0x6
#define _TU16ACON1_OSEN_POSITION                            0x6
#define _TU16ACON1_OSEN_SIZE                                0x1
#define _TU16ACON1_OSEN_LENGTH                              0x1
#define _TU16ACON1_OSEN_MASK                                0x40
#define _TU16ACON1_RUN_POSN                                 0x7
#define _TU16ACON1_RUN_POSITION                             0x7
#define _TU16ACON1_RUN_SIZE                                 0x1
#define _TU16ACON1_RUN_LENGTH                               0x1
#define _TU16ACON1_RUN_MASK                                 0x80
#define _TU16ACON1_TU16ACIF_POSN                            0x0
#define _TU16ACON1_TU16ACIF_POSITION                        0x0
#define _TU16ACON1_TU16ACIF_SIZE                            0x1
#define _TU16ACON1_TU16ACIF_LENGTH                          0x1
#define _TU16ACON1_TU16ACIF_MASK                            0x1
#define _TU16ACON1_TU16AZIF_POSN                            0x1
#define _TU16ACON1_TU16AZIF_POSITION                        0x1
#define _TU16ACON1_TU16AZIF_SIZE                            0x1
#define _TU16ACON1_TU16AZIF_LENGTH                          0x1
#define _TU16ACON1_TU16AZIF_MASK                            0x2
#define _TU16ACON1_TU16APRIF_POSN                           0x2
#define _TU16ACON1_TU16APRIF_POSITION                       0x2
#define _TU16ACON1_TU16APRIF_SIZE                           0x1
#define _TU16ACON1_TU16APRIF_LENGTH                         0x1
#define _TU16ACON1_TU16APRIF_MASK                           0x4
#define _TU16ACON1_TU16ACAPT_POSN                           0x3
#define _TU16ACON1_TU16ACAPT_POSITION                       0x3
#define _TU16ACON1_TU16ACAPT_SIZE                           0x1
#define _TU16ACON1_TU16ACAPT_LENGTH                         0x1
#define _TU16ACON1_TU16ACAPT_MASK                           0x8
#define _TU16ACON1_TU16ALIMIT_POSN                          0x4
#define _TU16ACON1_TU16ALIMIT_POSITION                      0x4
#define _TU16ACON1_TU16ALIMIT_SIZE                          0x1
#define _TU16ACON1_TU16ALIMIT_LENGTH                        0x1
#define _TU16ACON1_TU16ALIMIT_MASK                          0x10
#define _TU16ACON1_TU16ACLR_POSN                            0x5
#define _TU16ACON1_TU16ACLR_POSITION                        0x5
#define _TU16ACON1_TU16ACLR_SIZE                            0x1
#define _TU16ACON1_TU16ACLR_LENGTH                          0x1
#define _TU16ACON1_TU16ACLR_MASK                            0x20
#define _TU16ACON1_TMRAOSEN_POSN                            0x6
#define _TU16ACON1_TMRAOSEN_POSITION                        0x6
#define _TU16ACON1_TMRAOSEN_SIZE                            0x1
#define _TU16ACON1_TMRAOSEN_LENGTH                          0x1
#define _TU16ACON1_TMRAOSEN_MASK                            0x40
#define _TU16ACON1_TU16ARUN_POSN                            0x7
#define _TU16ACON1_TU16ARUN_POSITION                        0x7
#define _TU16ACON1_TU16ARUN_SIZE                            0x1
#define _TU16ACON1_TU16ARUN_LENGTH                          0x1
#define _TU16ACON1_TU16ARUN_MASK                            0x80

// Register: TU16AHLT
#define TU16AHLT TU16AHLT
extern volatile unsigned char           TU16AHLT            __at(0x39F);
#ifndef _LIB_BUILD
asm("TU16AHLT equ 039Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STOP                   :2;
        unsigned RESET                  :2;
        unsigned START                  :2;
        unsigned CSYNC                  :1;
        unsigned EPOL                   :1;
    };
    struct {
        unsigned STOP0                  :1;
        unsigned STOP1                  :1;
        unsigned RESET0                 :1;
        unsigned RESET1                 :1;
        unsigned START0                 :1;
        unsigned START1                 :1;
    };
    struct {
        unsigned TU16ASTOP              :2;
        unsigned TU16ARESET             :2;
        unsigned TU16ASTART             :2;
        unsigned TU16ACSYNC             :1;
        unsigned TU16AEPOL              :1;
    };
    struct {
        unsigned TU16ASTOP0             :1;
        unsigned TU16ASTOP1             :1;
        unsigned TU16ARESET0            :1;
        unsigned TU16ARESET1            :1;
        unsigned TU16ASTART0            :1;
        unsigned TU16ASTART1            :1;
    };
} TU16AHLTbits_t;
