garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// Register: TU16ACRT
#define TU16ACRT TU16ACRT
extern volatile unsigned char           TU16ACRT            __at(0x3A4);
#ifndef _LIB_BUILD
asm("TU16ACRT equ 03A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRT                    :8;
    };
    struct {
        unsigned CRT0                   :1;
        unsigned CRT1                   :1;
        unsigned CRT2                   :1;
        unsigned CRT3                   :1;
        unsigned CRT4                   :1;
        unsigned CRT5                   :1;
        unsigned CRT6                   :1;
        unsigned CRT7                   :1;
    };
    struct {
        unsigned TU16ACRT0              :1;
        unsigned TU16ACRT1              :1;
        unsigned TU16ACRT2              :1;
        unsigned TU16ACRT3              :1;
        unsigned TU16ACRT4              :1;
        unsigned TU16ACRT5              :1;
        unsigned TU16ACRT6              :1;
        unsigned TU16ACRT7              :1;
    };
    struct {
        unsigned TU16ACR24              :1;
        unsigned TU16ACR25              :1;
        unsigned TU16ACR26              :1;
        unsigned TU16ACR27              :1;
        unsigned TU16ACR28              :1;
        unsigned TU16ACR29              :1;
        unsigned TU16ACR30              :1;
        unsigned TU16ACR31              :1;
    };
} TU16ACRTbits_t;
extern volatile TU16ACRTbits_t TU16ACRTbits __at(0x3A4);
// bitfield macros
#define _TU16ACRT_CRT_POSN                                  0x0
#define _TU16ACRT_CRT_POSITION                              0x0
#define _TU16ACRT_CRT_SIZE                                  0x8
#define _TU16ACRT_CRT_LENGTH                                0x8
#define _TU16ACRT_CRT_MASK                                  0xFF
#define _TU16ACRT_CRT0_POSN                                 0x0
#define _TU16ACRT_CRT0_POSITION                             0x0
#define _TU16ACRT_CRT0_SIZE                                 0x1
#define _TU16ACRT_CRT0_LENGTH                               0x1
#define _TU16ACRT_CRT0_MASK                                 0x1
#define _TU16ACRT_CRT1_POSN                                 0x1
#define _TU16ACRT_CRT1_POSITION                             0x1
#define _TU16ACRT_CRT1_SIZE                                 0x1
#define _TU16ACRT_CRT1_LENGTH                               0x1
#define _TU16ACRT_CRT1_MASK                                 0x2
#define _TU16ACRT_CRT2_POSN                                 0x2
#define _TU16ACRT_CRT2_POSITION                             0x2
#define _TU16ACRT_CRT2_SIZE                                 0x1
#define _TU16ACRT_CRT2_LENGTH                               0x1
#define _TU16ACRT_CRT2_MASK                                 0x4
#define _TU16ACRT_CRT3_POSN                                 0x3
#define _TU16ACRT_CRT3_POSITION                             0x3
#define _TU16ACRT_CRT3_SIZE                                 0x1
#define _TU16ACRT_CRT3_LENGTH                               0x1
#define _TU16ACRT_CRT3_MASK                                 0x8
#define _TU16ACRT_CRT4_POSN                                 0x4
#define _TU16ACRT_CRT4_POSITION                             0x4
#define _TU16ACRT_CRT4_SIZE                                 0x1
#define _TU16ACRT_CRT4_LENGTH                               0x1
#define _TU16ACRT_CRT4_MASK                                 0x10
#define _TU16ACRT_CRT5_POSN                                 0x5
#define _TU16ACRT_CRT5_POSITION                             0x5
#define _TU16ACRT_CRT5_SIZE                                 0x1
#define _TU16ACRT_CRT5_LENGTH                               0x1
#define _TU16ACRT_CRT5_MASK                                 0x20
#define _TU16ACRT_CRT6_POSN                                 0x6
#define _TU16ACRT_CRT6_POSITION                             0x6
#define _TU16ACRT_CRT6_SIZE                                 0x1
#define _TU16ACRT_CRT6_LENGTH                               0x1
#define _TU16ACRT_CRT6_MASK                                 0x40
#define _TU16ACRT_CRT7_POSN                                 0x7
#define _TU16ACRT_CRT7_POSITION                             0x7
#define _TU16ACRT_CRT7_SIZE                                 0x1
#define _TU16ACRT_CRT7_LENGTH                               0x1
#define _TU16ACRT_CRT7_MASK                                 0x80
#define _TU16ACRT_TU16ACRT0_POSN                            0x0
#define _TU16ACRT_TU16ACRT0_POSITION                        0x0
#define _TU16ACRT_TU16ACRT0_SIZE                            0x1
#define _TU16ACRT_TU16ACRT0_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT0_MASK                            0x1
#define _TU16ACRT_TU16ACRT1_POSN                            0x1
#define _TU16ACRT_TU16ACRT1_POSITION                        0x1
#define _TU16ACRT_TU16ACRT1_SIZE                            0x1
#define _TU16ACRT_TU16ACRT1_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT1_MASK                            0x2
#define _TU16ACRT_TU16ACRT2_POSN                            0x2
#define _TU16ACRT_TU16ACRT2_POSITION                        0x2
#define _TU16ACRT_TU16ACRT2_SIZE                            0x1
#define _TU16ACRT_TU16ACRT2_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT2_MASK                            0x4
#define _TU16ACRT_TU16ACRT3_POSN                            0x3
#define _TU16ACRT_TU16ACRT3_POSITION                        0x3
#define _TU16ACRT_TU16ACRT3_SIZE                            0x1
#define _TU16ACRT_TU16ACRT3_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT3_MASK                            0x8
#define _TU16ACRT_TU16ACRT4_POSN                            0x4
#define _TU16ACRT_TU16ACRT4_POSITION                        0x4
#define _TU16ACRT_TU16ACRT4_SIZE                            0x1
#define _TU16ACRT_TU16ACRT4_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT4_MASK                            0x10
#define _TU16ACRT_TU16ACRT5_POSN                            0x5
#define _TU16ACRT_TU16ACRT5_POSITION                        0x5
#define _TU16ACRT_TU16ACRT5_SIZE                            0x1
#define _TU16ACRT_TU16ACRT5_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT5_MASK                            0x20
#define _TU16ACRT_TU16ACRT6_POSN                            0x6
#define _TU16ACRT_TU16ACRT6_POSITION                        0x6
#define _TU16ACRT_TU16ACRT6_SIZE                            0x1
#define _TU16ACRT_TU16ACRT6_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT6_MASK                            0x40
#define _TU16ACRT_TU16ACRT7_POSN                            0x7
#define _TU16ACRT_TU16ACRT7_POSITION                        0x7
#define _TU16ACRT_TU16ACRT7_SIZE                            0x1
#define _TU16ACRT_TU16ACRT7_LENGTH                          0x1
#define _TU16ACRT_TU16ACRT7_MASK                            0x80
#define _TU16ACRT_TU16ACR24_POSN                            0x0
#define _TU16ACRT_TU16ACR24_POSITION                        0x0
#define _TU16ACRT_TU16ACR24_SIZE                            0x1
#define _TU16ACRT_TU16ACR24_LENGTH                          0x1
#define _TU16ACRT_TU16ACR24_MASK                            0x1
#define _TU16ACRT_TU16ACR25_POSN                            0x1
#define _TU16ACRT_TU16ACR25_POSITION                        0x1
#define _TU16ACRT_TU16ACR25_SIZE                            0x1
#define _TU16ACRT_TU16ACR25_LENGTH                          0x1
#define _TU16ACRT_TU16ACR25_MASK                            0x2
#define _TU16ACRT_TU16ACR26_POSN                            0x2
#define _TU16ACRT_TU16ACR26_POSITION                        0x2
#define _TU16ACRT_TU16ACR26_SIZE                            0x1
#define _TU16ACRT_TU16ACR26_LENGTH                          0x1
#define _TU16ACRT_TU16ACR26_MASK                            0x4
#define _TU16ACRT_TU16ACR27_POSN                            0x3
#define _TU16ACRT_TU16ACR27_POSITION                        0x3
#define _TU16ACRT_TU16ACR27_SIZE                            0x1
#define _TU16ACRT_TU16ACR27_LENGTH                          0x1
#define _TU16ACRT_TU16ACR27_MASK                            0x8
#define _TU16ACRT_TU16ACR28_POSN                            0x4
#define _TU16ACRT_TU16ACR28_POSITION                        0x4
#define _TU16ACRT_TU16ACR28_SIZE                            0x1
#define _TU16ACRT_TU16ACR28_LENGTH                          0x1
#define _TU16ACRT_TU16ACR28_MASK                            0x10
#define _TU16ACRT_TU16ACR29_POSN                            0x5
#define _TU16ACRT_TU16ACR29_POSITION                        0x5
#define _TU16ACRT_TU16ACR29_SIZE                            0x1
#define _TU16ACRT_TU16ACR29_LENGTH                          0x1
#define _TU16ACRT_TU16ACR29_MASK                            0x20
#define _TU16ACRT_TU16ACR30_POSN                            0x6
#define _TU16ACRT_TU16ACR30_POSITION                        0x6
#define _TU16ACRT_TU16ACR30_SIZE                            0x1
#define _TU16ACRT_TU16ACR30_LENGTH                          0x1
#define _TU16ACRT_TU16ACR30_MASK                            0x40
#define _TU16ACRT_TU16ACR31_POSN                            0x7
#define _TU16ACRT_TU16ACR31_POSITION                        0x7
#define _TU16ACRT_TU16ACR31_SIZE                            0x1
#define _TU16ACRT_TU16ACR31_LENGTH                          0x1
#define _TU16ACRT_TU16ACR31_MASK                            0x80

// Register: TU16APR
#define TU16APR TU16APR
extern volatile unsigned long           TU16APR             __at(0x3A5);
#ifndef _LIB_BUILD
asm("TU16APR equ 03A5h");
#endif

// Register: TU16APRL
#define TU16APRL TU16APRL
extern volatile unsigned char           TU16APRL            __at(0x3A5);
#ifndef _LIB_BUILD
asm("TU16APRL equ 03A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
    struct {
        unsigned PRL0                   :1;
        unsigned PRL1                   :1;
        unsigned PRL2                   :1;
        unsigned PRL3                   :1;
        unsigned PRL4                   :1;
        unsigned PRL5                   :1;
        unsigned PRL6                   :1;
        unsigned PRL7                   :1;
    };
    struct {
        unsigned TU16APRL0              :1;
        unsigned TU16APRL1              :1;
        unsigned TU16APRL2              :1;
        unsigned TU16APRL3              :1;
        unsigned TU16APRL4              :1;
        unsigned TU16APRL5              :1;
        unsigned TU16APRL6              :1;
        unsigned TU16APRL7              :1;
    };
    struct {
        unsigned TU16APR0               :1;
        unsigned TU16APR1               :1;
        unsigned TU16APR2               :1;
        unsigned TU16APR3               :1;
        unsigned TU16APR4               :1;
        unsigned TU16APR5               :1;
        unsigned TU16APR6               :1;
        unsigned TU16APR7               :1;
    };
} TU16APRLbits_t;
