garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// Register: IOCDP
#define IOCDP IOCDP
extern volatile unsigned char           IOCDP               __at(0x41D);
#ifndef _LIB_BUILD
asm("IOCDP equ 041Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCDP0                 :1;
        unsigned IOCDP1                 :1;
        unsigned IOCDP2                 :1;
        unsigned IOCDP3                 :1;
        unsigned IOCDP4                 :1;
        unsigned IOCDP5                 :1;
        unsigned IOCDP6                 :1;
        unsigned IOCDP7                 :1;
    };
} IOCDPbits_t;
extern volatile IOCDPbits_t IOCDPbits __at(0x41D);
// bitfield macros
#define _IOCDP_IOCDP0_POSN                                  0x0
#define _IOCDP_IOCDP0_POSITION                              0x0
#define _IOCDP_IOCDP0_SIZE                                  0x1
#define _IOCDP_IOCDP0_LENGTH                                0x1
#define _IOCDP_IOCDP0_MASK                                  0x1
#define _IOCDP_IOCDP1_POSN                                  0x1
#define _IOCDP_IOCDP1_POSITION                              0x1
#define _IOCDP_IOCDP1_SIZE                                  0x1
#define _IOCDP_IOCDP1_LENGTH                                0x1
#define _IOCDP_IOCDP1_MASK                                  0x2
#define _IOCDP_IOCDP2_POSN                                  0x2
#define _IOCDP_IOCDP2_POSITION                              0x2
#define _IOCDP_IOCDP2_SIZE                                  0x1
#define _IOCDP_IOCDP2_LENGTH                                0x1
#define _IOCDP_IOCDP2_MASK                                  0x4
#define _IOCDP_IOCDP3_POSN                                  0x3
#define _IOCDP_IOCDP3_POSITION                              0x3
#define _IOCDP_IOCDP3_SIZE                                  0x1
#define _IOCDP_IOCDP3_LENGTH                                0x1
#define _IOCDP_IOCDP3_MASK                                  0x8
#define _IOCDP_IOCDP4_POSN                                  0x4
#define _IOCDP_IOCDP4_POSITION                              0x4
#define _IOCDP_IOCDP4_SIZE                                  0x1
#define _IOCDP_IOCDP4_LENGTH                                0x1
#define _IOCDP_IOCDP4_MASK                                  0x10
#define _IOCDP_IOCDP5_POSN                                  0x5
#define _IOCDP_IOCDP5_POSITION                              0x5
#define _IOCDP_IOCDP5_SIZE                                  0x1
#define _IOCDP_IOCDP5_LENGTH                                0x1
#define _IOCDP_IOCDP5_MASK                                  0x20
#define _IOCDP_IOCDP6_POSN                                  0x6
#define _IOCDP_IOCDP6_POSITION                              0x6
#define _IOCDP_IOCDP6_SIZE                                  0x1
#define _IOCDP_IOCDP6_LENGTH                                0x1
#define _IOCDP_IOCDP6_MASK                                  0x40
#define _IOCDP_IOCDP7_POSN                                  0x7
#define _IOCDP_IOCDP7_POSITION                              0x7
#define _IOCDP_IOCDP7_SIZE                                  0x1
#define _IOCDP_IOCDP7_LENGTH                                0x1
#define _IOCDP_IOCDP7_MASK                                  0x80

// Register: IOCDN
#define IOCDN IOCDN
extern volatile unsigned char           IOCDN               __at(0x41E);
#ifndef _LIB_BUILD
asm("IOCDN equ 041Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCDN0                 :1;
        unsigned IOCDN1                 :1;
        unsigned IOCDN2                 :1;
        unsigned IOCDN3                 :1;
        unsigned IOCDN4                 :1;
        unsigned IOCDN5                 :1;
        unsigned IOCDN6                 :1;
        unsigned IOCDN7                 :1;
    };
} IOCDNbits_t;
extern volatile IOCDNbits_t IOCDNbits __at(0x41E);
// bitfield macros
#define _IOCDN_IOCDN0_POSN                                  0x0
#define _IOCDN_IOCDN0_POSITION                              0x0
#define _IOCDN_IOCDN0_SIZE                                  0x1
#define _IOCDN_IOCDN0_LENGTH                                0x1
#define _IOCDN_IOCDN0_MASK                                  0x1
#define _IOCDN_IOCDN1_POSN                                  0x1
#define _IOCDN_IOCDN1_POSITION                              0x1
#define _IOCDN_IOCDN1_SIZE                                  0x1
#define _IOCDN_IOCDN1_LENGTH                                0x1
#define _IOCDN_IOCDN1_MASK                                  0x2
#define _IOCDN_IOCDN2_POSN                                  0x2
#define _IOCDN_IOCDN2_POSITION                              0x2
#define _IOCDN_IOCDN2_SIZE                                  0x1
#define _IOCDN_IOCDN2_LENGTH                                0x1
#define _IOCDN_IOCDN2_MASK                                  0x4
#define _IOCDN_IOCDN3_POSN                                  0x3
#define _IOCDN_IOCDN3_POSITION                              0x3
#define _IOCDN_IOCDN3_SIZE                                  0x1
#define _IOCDN_IOCDN3_LENGTH                                0x1
#define _IOCDN_IOCDN3_MASK                                  0x8
#define _IOCDN_IOCDN4_POSN                                  0x4
#define _IOCDN_IOCDN4_POSITION                              0x4
#define _IOCDN_IOCDN4_SIZE                                  0x1
#define _IOCDN_IOCDN4_LENGTH                                0x1
#define _IOCDN_IOCDN4_MASK                                  0x10
#define _IOCDN_IOCDN5_POSN                                  0x5
#define _IOCDN_IOCDN5_POSITION                              0x5
#define _IOCDN_IOCDN5_SIZE                                  0x1
#define _IOCDN_IOCDN5_LENGTH                                0x1
#define _IOCDN_IOCDN5_MASK                                  0x20
#define _IOCDN_IOCDN6_POSN                                  0x6
#define _IOCDN_IOCDN6_POSITION                              0x6
#define _IOCDN_IOCDN6_SIZE                                  0x1
#define _IOCDN_IOCDN6_LENGTH                                0x1
#define _IOCDN_IOCDN6_MASK                                  0x40
#define _IOCDN_IOCDN7_POSN                                  0x7
#define _IOCDN_IOCDN7_POSITION                              0x7
#define _IOCDN_IOCDN7_SIZE                                  0x1
#define _IOCDN_IOCDN7_LENGTH                                0x1
#define _IOCDN_IOCDN7_MASK                                  0x80

// Register: IOCDF
#define IOCDF IOCDF
extern volatile unsigned char           IOCDF               __at(0x41F);
#ifndef _LIB_BUILD
asm("IOCDF equ 041Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCDF0                 :1;
        unsigned IOCDF1                 :1;
        unsigned IOCDF2                 :1;
        unsigned IOCDF3                 :1;
        unsigned IOCDF4                 :1;
        unsigned IOCDF5                 :1;
        unsigned IOCDF6                 :1;
        unsigned IOCDF7                 :1;
    };
} IOCDFbits_t;
extern volatile IOCDFbits_t IOCDFbits __at(0x41F);
// bitfield macros
#define _IOCDF_IOCDF0_POSN                                  0x0
#define _IOCDF_IOCDF0_POSITION                              0x0
#define _IOCDF_IOCDF0_SIZE                                  0x1
#define _IOCDF_IOCDF0_LENGTH                                0x1
#define _IOCDF_IOCDF0_MASK                                  0x1
#define _IOCDF_IOCDF1_POSN                                  0x1
#define _IOCDF_IOCDF1_POSITION                              0x1
#define _IOCDF_IOCDF1_SIZE                                  0x1
#define _IOCDF_IOCDF1_LENGTH                                0x1
#define _IOCDF_IOCDF1_MASK                                  0x2
#define _IOCDF_IOCDF2_POSN                                  0x2
#define _IOCDF_IOCDF2_POSITION                              0x2
#define _IOCDF_IOCDF2_SIZE                                  0x1
#define _IOCDF_IOCDF2_LENGTH                                0x1
#define _IOCDF_IOCDF2_MASK                                  0x4
#define _IOCDF_IOCDF3_POSN                                  0x3
#define _IOCDF_IOCDF3_POSITION                              0x3
#define _IOCDF_IOCDF3_SIZE                                  0x1
#define _IOCDF_IOCDF3_LENGTH                                0x1
#define _IOCDF_IOCDF3_MASK                                  0x8
#define _IOCDF_IOCDF4_POSN                                  0x4
#define _IOCDF_IOCDF4_POSITION                              0x4
#define _IOCDF_IOCDF4_SIZE                                  0x1
#define _IOCDF_IOCDF4_LENGTH                                0x1
#define _IOCDF_IOCDF4_MASK                                  0x10
#define _IOCDF_IOCDF5_POSN                                  0x5
#define _IOCDF_IOCDF5_POSITION                              0x5
#define _IOCDF_IOCDF5_SIZE                                  0x1
#define _IOCDF_IOCDF5_LENGTH                                0x1
#define _IOCDF_IOCDF5_MASK                                  0x20
#define _IOCDF_IOCDF6_POSN                                  0x6
#define _IOCDF_IOCDF6_POSITION                              0x6
#define _IOCDF_IOCDF6_SIZE                                  0x1
#define _IOCDF_IOCDF6_LENGTH                                0x1
#define _IOCDF_IOCDF6_MASK                                  0x40
#define _IOCDF_IOCDF7_POSN                                  0x7
#define _IOCDF_IOCDF7_POSITION                              0x7
#define _IOCDF_IOCDF7_SIZE                                  0x1
#define _IOCDF_IOCDF7_LENGTH                                0x1
#define _IOCDF_IOCDF7_MASK                                  0x80

