garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern volatile PWM3S1P1Lbits_t PWM3S1P1Lbits __at(0x489);
// bitfield macros
#define _PWM3S1P1L_S1P1L_POSN                               0x0
#define _PWM3S1P1L_S1P1L_POSITION                           0x0
#define _PWM3S1P1L_S1P1L_SIZE                               0x8
#define _PWM3S1P1L_S1P1L_LENGTH                             0x8
#define _PWM3S1P1L_S1P1L_MASK                               0xFF

// Register: PWM3S1P1H
#define PWM3S1P1H PWM3S1P1H
extern volatile unsigned char           PWM3S1P1H           __at(0x48A);
#ifndef _LIB_BUILD
asm("PWM3S1P1H equ 048Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1H                  :8;
    };
} PWM3S1P1Hbits_t;
extern volatile PWM3S1P1Hbits_t PWM3S1P1Hbits __at(0x48A);
// bitfield macros
#define _PWM3S1P1H_S1P1H_POSN                               0x0
#define _PWM3S1P1H_S1P1H_POSITION                           0x0
#define _PWM3S1P1H_S1P1H_SIZE                               0x8
#define _PWM3S1P1H_S1P1H_LENGTH                             0x8
#define _PWM3S1P1H_S1P1H_MASK                               0xFF

// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
extern volatile unsigned short          PWM3S1P2            __at(0x48B);
#ifndef _LIB_BUILD
asm("PWM3S1P2 equ 048Bh");
#endif

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
extern volatile unsigned char           PWM3S1P2L           __at(0x48B);
#ifndef _LIB_BUILD
asm("PWM3S1P2L equ 048Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2L                  :8;
    };
} PWM3S1P2Lbits_t;
extern volatile PWM3S1P2Lbits_t PWM3S1P2Lbits __at(0x48B);
// bitfield macros
#define _PWM3S1P2L_S1P2L_POSN                               0x0
#define _PWM3S1P2L_S1P2L_POSITION                           0x0
#define _PWM3S1P2L_S1P2L_SIZE                               0x8
#define _PWM3S1P2L_S1P2L_LENGTH                             0x8
#define _PWM3S1P2L_S1P2L_MASK                               0xFF

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
extern volatile unsigned char           PWM3S1P2H           __at(0x48C);
#ifndef _LIB_BUILD
asm("PWM3S1P2H equ 048Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2H                  :8;
    };
} PWM3S1P2Hbits_t;
extern volatile PWM3S1P2Hbits_t PWM3S1P2Hbits __at(0x48C);
// bitfield macros
#define _PWM3S1P2H_S1P2H_POSN                               0x0
#define _PWM3S1P2H_S1P2H_POSITION                           0x0
#define _PWM3S1P2H_S1P2H_SIZE                               0x8
#define _PWM3S1P2H_S1P2H_LENGTH                             0x8
#define _PWM3S1P2H_S1P2H_MASK                               0xFF

// Register: PWMLOAD
#define PWMLOAD PWMLOAD
extern volatile unsigned char           PWMLOAD             __at(0x499);
#ifndef _LIB_BUILD
asm("PWMLOAD equ 0499h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1LD                :1;
        unsigned MPWM2LD                :1;
        unsigned MPWM3LD                :1;
    };
} PWMLOADbits_t;
extern volatile PWMLOADbits_t PWMLOADbits __at(0x499);
// bitfield macros
#define _PWMLOAD_MPWM1LD_POSN                               0x0
#define _PWMLOAD_MPWM1LD_POSITION                           0x0
#define _PWMLOAD_MPWM1LD_SIZE                               0x1
#define _PWMLOAD_MPWM1LD_LENGTH                             0x1
#define _PWMLOAD_MPWM1LD_MASK                               0x1
#define _PWMLOAD_MPWM2LD_POSN                               0x1
#define _PWMLOAD_MPWM2LD_POSITION                           0x1
#define _PWMLOAD_MPWM2LD_SIZE                               0x1
#define _PWMLOAD_MPWM2LD_LENGTH                             0x1
#define _PWMLOAD_MPWM2LD_MASK                               0x2
#define _PWMLOAD_MPWM3LD_POSN                               0x2
#define _PWMLOAD_MPWM3LD_POSITION                           0x2
#define _PWMLOAD_MPWM3LD_SIZE                               0x1
#define _PWMLOAD_MPWM3LD_LENGTH                             0x1
#define _PWMLOAD_MPWM3LD_MASK                               0x4

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0x49A);
#ifndef _LIB_BUILD
asm("PWMEN equ 049Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1EN                :1;
        unsigned MPWM2EN                :1;
        unsigned MPWM3EN                :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0x49A);
// bitfield macros
#define _PWMEN_MPWM1EN_POSN                                 0x0
#define _PWMEN_MPWM1EN_POSITION                             0x0
#define _PWMEN_MPWM1EN_SIZE                                 0x1
#define _PWMEN_MPWM1EN_LENGTH                               0x1
#define _PWMEN_MPWM1EN_MASK                                 0x1
#define _PWMEN_MPWM2EN_POSN                                 0x1
#define _PWMEN_MPWM2EN_POSITION                             0x1
#define _PWMEN_MPWM2EN_SIZE                                 0x1
#define _PWMEN_MPWM2EN_LENGTH                               0x1
#define _PWMEN_MPWM2EN_MASK                                 0x2
#define _PWMEN_MPWM3EN_POSN                                 0x2
#define _PWMEN_MPWM3EN_POSITION                             0x2
#define _PWMEN_MPWM3EN_SIZE                                 0x1
#define _PWMEN_MPWM3EN_LENGTH                               0x1
#define _PWMEN_MPWM3EN_MASK                                 0x4

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0x49E);
#ifndef _LIB_BUILD
asm("IPR0 equ 049Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIP                   :1;
        unsigned HLVDIP                 :1;
        unsigned OSFIP                  :1;
        unsigned CSWIP                  :1;
        unsigned NVMIP                  :1;
        unsigned CLC1IP                 :1;
        unsigned CRCIP                  :1;
        unsigned IOCIP                  :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0x49E);
// bitfield macros
#define _IPR0_SWIP_POSN                                     0x0
#define _IPR0_SWIP_POSITION                                 0x0
#define _IPR0_SWIP_SIZE                                     0x1
#define _IPR0_SWIP_LENGTH                                   0x1
#define _IPR0_SWIP_MASK                                     0x1
#define _IPR0_HLVDIP_POSN                                   0x1
#define _IPR0_HLVDIP_POSITION                               0x1
#define _IPR0_HLVDIP_SIZE                                   0x1
#define _IPR0_HLVDIP_LENGTH                                 0x1
#define _IPR0_HLVDIP_MASK                                   0x2
#define _IPR0_OSFIP_POSN                                    0x2
#define _IPR0_OSFIP_POSITION                                0x2
#define _IPR0_OSFIP_SIZE                                    0x1
#define _IPR0_OSFIP_LENGTH                                  0x1
#define _IPR0_OSFIP_MASK                                    0x4
#define _IPR0_CSWIP_POSN                                    0x3
#define _IPR0_CSWIP_POSITION                                0x3
#define _IPR0_CSWIP_SIZE                                    0x1
#define _IPR0_CSWIP_LENGTH                                  0x1
#define _IPR0_CSWIP_MASK                                    0x8
#define _IPR0_NVMIP_POSN                                    0x4
#define _IPR0_NVMIP_POSITION                                0x4
#define _IPR0_NVMIP_SIZE                                    0x1
#define _IPR0_NVMIP_LENGTH                                  0x1
#define _IPR0_NVMIP_MASK                                    0x10
#define _IPR0_CLC1IP_POSN                                   0x5
#define _IPR0_CLC1IP_POSITION                               0x5
#define _IPR0_CLC1IP_SIZE                                   0x1
#define _IPR0_CLC1IP_LENGTH                                 0x1
#define _IPR0_CLC1IP_MASK                                   0x20
#define _IPR0_CRCIP_POSN                                    0x6
#define _IPR0_CRCIP_POSITION                                0x6
#define _IPR0_CRCIP_SIZE                                    0x1
#define _IPR0_CRCIP_LENGTH                                  0x1
#define _IPR0_CRCIP_MASK                                    0x40
#define _IPR0_IOCIP_POSN                                    0x7
#define _IPR0_IOCIP_POSITION                                0x7
#define _IPR0_IOCIP_SIZE                                    0x1
#define _IPR0_IOCIP_LENGTH                                  0x1
#define _IPR0_IOCIP_MASK                                    0x80

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0x49F);
#ifndef _LIB_BUILD
asm("IPR1 equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned ADTIP                  :1;
        unsigned ADIP                   :1;
        unsigned ACTIP                  :1;
        unsigned I2C2RXIP               :1;
        unsigned I2C2TXIP               :1;
        unsigned I2C2IP                 :1;
        unsigned I2C2EIP                :1;
    };
} IPR1bits_t;
extern volatile IPR1bits_t IPR1bits __at(0x49F);
// bitfield macros
#define _IPR1_INT0IP_POSN                                   0x0
#define _IPR1_INT0IP_POSITION                               0x0
#define _IPR1_INT0IP_SIZE                                   0x1
#define _IPR1_INT0IP_LENGTH                                 0x1
#define _IPR1_INT0IP_MASK                                   0x1
#define _IPR1_ADTIP_POSN                                    0x1
#define _IPR1_ADTIP_POSITION                                0x1
#define _IPR1_ADTIP_SIZE                                    0x1
#define _IPR1_ADTIP_LENGTH                                  0x1
#define _IPR1_ADTIP_MASK                                    0x2
#define _IPR1_ADIP_POSN                                     0x2
#define _IPR1_ADIP_POSITION                                 0x2
#define _IPR1_ADIP_SIZE                                     0x1
#define _IPR1_ADIP_LENGTH                                   0x1
#define _IPR1_ADIP_MASK                                     0x4
#define _IPR1_ACTIP_POSN                                    0x3
#define _IPR1_ACTIP_POSITION                                0x3
#define _IPR1_ACTIP_SIZE                                    0x1
#define _IPR1_ACTIP_LENGTH                                  0x1
#define _IPR1_ACTIP_MASK                                    0x8
#define _IPR1_I2C2RXIP_POSN                                 0x4
#define _IPR1_I2C2RXIP_POSITION                             0x4
#define _IPR1_I2C2RXIP_SIZE                                 0x1
#define _IPR1_I2C2RXIP_LENGTH                               0x1
#define _IPR1_I2C2RXIP_MASK                                 0x10
#define _IPR1_I2C2TXIP_POSN                                 0x5
#define _IPR1_I2C2TXIP_POSITION                             0x5
#define _IPR1_I2C2TXIP_SIZE                                 0x1
#define _IPR1_I2C2TXIP_LENGTH                               0x1
#define _IPR1_I2C2TXIP_MASK                                 0x20
#define _IPR1_I2C2IP_POSN                                   0x6
#define _IPR1_I2C2IP_POSITION                               0x6
#define _IPR1_I2C2IP_SIZE                                   0x1
#define _IPR1_I2C2IP_LENGTH                                 0x1
#define _IPR1_I2C2IP_MASK                                   0x40
#define _IPR1_I2C2EIP_POSN                                  0x7
#define _IPR1_I2C2EIP_POSITION                              0x7
#define _IPR1_I2C2EIP_SIZE                                  0x1
#define _IPR1_I2C2EIP_LENGTH                                0x1
#define _IPR1_I2C2EIP_MASK                                  0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0x4A0);
#ifndef _LIB_BUILD
asm("IPR2 equ 04A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD2IP                 :1;
        unsigned CLC5IP                 :1;
        unsigned IOCSRIP                :1;
        unsigned ZCD1IP                 :1;
        unsigned DMA1SCNTIP             :1;
        unsigned DMA1DCNTIP             :1;
        unsigned DMA1ORIP               :1;
        unsigned DMA1AIP                :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0x4A0);
// bitfield macros
#define _IPR2_ZCD2IP_POSN                                   0x0
#define _IPR2_ZCD2IP_POSITION                               0x0
#define _IPR2_ZCD2IP_SIZE                                   0x1
#define _IPR2_ZCD2IP_LENGTH                                 0x1
#define _IPR2_ZCD2IP_MASK                                   0x1
#define _IPR2_CLC5IP_POSN                                   0x1
#define _IPR2_CLC5IP_POSITION                               0x1
#define _IPR2_CLC5IP_SIZE                                   0x1
#define _IPR2_CLC5IP_LENGTH                                 0x1
#define _IPR2_CLC5IP_MASK                                   0x2
#define _IPR2_IOCSRIP_POSN                                  0x2
#define _IPR2_IOCSRIP_POSITION                              0x2
#define _IPR2_IOCSRIP_SIZE                                  0x1
#define _IPR2_IOCSRIP_LENGTH                                0x1
#define _IPR2_IOCSRIP_MASK                                  0x4
#define _IPR2_ZCD1IP_POSN                                   0x3
#define _IPR2_ZCD1IP_POSITION                               0x3
#define _IPR2_ZCD1IP_SIZE                                   0x1
#define _IPR2_ZCD1IP_LENGTH                                 0x1
#define _IPR2_ZCD1IP_MASK                                   0x8
#define _IPR2_DMA1SCNTIP_POSN                               0x4
#define _IPR2_DMA1SCNTIP_POSITION                           0x4
#define _IPR2_DMA1SCNTIP_SIZE                               0x1
#define _IPR2_DMA1SCNTIP_LENGTH                             0x1
#define _IPR2_DMA1SCNTIP_MASK                               0x10
#define _IPR2_DMA1DCNTIP_POSN                               0x5
#define _IPR2_DMA1DCNTIP_POSITION                           0x5
#define _IPR2_DMA1DCNTIP_SIZE                               0x1
#define _IPR2_DMA1DCNTIP_LENGTH                             0x1
#define _IPR2_DMA1DCNTIP_MASK                               0x20
#define _IPR2_DMA1ORIP_POSN                                 0x6
#define _IPR2_DMA1ORIP_POSITION                             0x6
#define _IPR2_DMA1ORIP_SIZE                                 0x1
#define _IPR2_DMA1ORIP_LENGTH                               0x1
#define _IPR2_DMA1ORIP_MASK                                 0x40
#define _IPR2_DMA1AIP_POSN                                  0x7
#define _IPR2_DMA1AIP_POSITION                              0x7
#define _IPR2_DMA1AIP_SIZE                                  0x1
#define _IPR2_DMA1AIP_LENGTH                                0x1
#define _IPR2_DMA1AIP_MASK                                  0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x4A1);
#ifndef _LIB_BUILD
asm("IPR3 equ 04A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIP               :1;
        unsigned SPI1TXIP               :1;
        unsigned SPI1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
        unsigned CCP1IP                 :1;
        unsigned TMR0IP                 :1;
    };
} IPR3bits_t;
