garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern const _CONFIG7bits_t _CONFIG7bits __at(0x300006);

// Register: CONFIG9
extern const unsigned char              _CONFIG9            __at(0x300008);
// bitfield definitions
typedef union {
    struct {
        unsigned WRTB                   :1;
        unsigned WRTC                   :1;
        unsigned WRTD                   :1;
        unsigned WRTSAF                 :1;
        unsigned                        :3;
        unsigned WRTAPP                 :1;
    };
} _CONFIG9bits_t;
extern const _CONFIG9bits_t _CONFIG9bits __at(0x300008);

// Register: CONFIG10
extern const unsigned char              _CONFIG10           __at(0x300009);
// bitfield definitions
typedef union {
    struct {
        unsigned CP                     :1;
    };
} _CONFIG10bits_t;
extern const _CONFIG10bits_t _CONFIG10bits __at(0x300009);

// Register: CONFIG11
extern const unsigned char              _CONFIG11           __at(0x30000A);
// bitfield definitions
typedef union {
    struct {
        unsigned CPD                    :1;
    };
} _CONFIG11bits_t;
extern const _CONFIG11bits_t _CONFIG11bits __at(0x30000A);

// Register: CONFIG13
extern const unsigned char              _CONFIG13           __at(0x300018);
// bitfield definitions
typedef union {
    struct {
        unsigned SAFLOCK                :1;
    };
} _CONFIG13bits_t;
extern const _CONFIG13bits_t _CONFIG13bits __at(0x300018);

// Register: CONFIG8
extern const unsigned char              _CONFIG8            __at(0x300019);
// bitfield definitions
typedef union {
    struct {
        unsigned SAFSZ                  :8;
    };
} _CONFIG8bits_t;
extern const _CONFIG8bits_t _CONFIG8bits __at(0x300019);

// Register: CONFIG12
extern const unsigned char              _CONFIG12           __at(0x30001C);
// bitfield definitions
typedef union {
    struct {
        unsigned ICSPDIS                :1;
    };
} _CONFIG12bits_t;
extern const _CONFIG12bits_t _CONFIG12bits __at(0x30001C);

extern const unsigned short             _IDLOCs[32]         __at(0x200000);
// Register: IDLOC0
extern const unsigned short             _IDLOC0             __at(0x200000);

// Register: IDLOC1
extern const unsigned short             _IDLOC1             __at(0x200002);

// Register: IDLOC2
extern const unsigned short             _IDLOC2             __at(0x200004);

// Register: IDLOC3
extern const unsigned short             _IDLOC3             __at(0x200006);

// Register: IDLOC4
extern const unsigned short             _IDLOC4             __at(0x200008);

// Register: IDLOC5
extern const unsigned short             _IDLOC5             __at(0x20000A);

// Register: IDLOC6
extern const unsigned short             _IDLOC6             __at(0x20000C);

// Register: IDLOC7
extern const unsigned short             _IDLOC7             __at(0x20000E);

// Register: IDLOC8
extern const unsigned short             _IDLOC8             __at(0x200010);

// Register: IDLOC9
extern const unsigned short             _IDLOC9             __at(0x200012);

// Register: IDLOC10
extern const unsigned short             _IDLOC10            __at(0x200014);

// Register: IDLOC11
extern const unsigned short             _IDLOC11            __at(0x200016);

// Register: IDLOC12
extern const unsigned short             _IDLOC12            __at(0x200018);

// Register: IDLOC13
extern const unsigned short             _IDLOC13            __at(0x20001A);

// Register: IDLOC14
extern const unsigned short             _IDLOC14            __at(0x20001C);

// Register: IDLOC15
extern const unsigned short             _IDLOC15            __at(0x20001E);

// Register: IDLOC16
extern const unsigned short             _IDLOC16            __at(0x200020);

// Register: IDLOC17
extern const unsigned short             _IDLOC17            __at(0x200022);

// Register: IDLOC18
extern const unsigned short             _IDLOC18            __at(0x200024);

// Register: IDLOC19
extern const unsigned short             _IDLOC19            __at(0x200026);

// Register: IDLOC20
extern const unsigned short             _IDLOC20            __at(0x200028);

// Register: IDLOC21
extern const unsigned short             _IDLOC21            __at(0x20002A);

// Register: IDLOC22
extern const unsigned short             _IDLOC22            __at(0x20002C);

// Register: IDLOC23
extern const unsigned short             _IDLOC23            __at(0x20002E);

// Register: IDLOC24
extern const unsigned short             _IDLOC24            __at(0x200030);

// Register: IDLOC25
extern const unsigned short             _IDLOC25            __at(0x200032);

// Register: IDLOC26
extern const unsigned short             _IDLOC26            __at(0x200034);

// Register: IDLOC27
extern const unsigned short             _IDLOC27            __at(0x200036);

// Register: IDLOC28
extern const unsigned short             _IDLOC28            __at(0x200038);

// Register: IDLOC29
extern const unsigned short             _IDLOC29            __at(0x20003A);

// Register: IDLOC30
extern const unsigned short             _IDLOC30            __at(0x20003C);

// Register: IDLOC31
extern const unsigned short             _IDLOC31            __at(0x20003E);

/*
 * Device ID
 */
extern const unsigned short             _DEVID              __at(0x3FFFFE);

/*
 * Revision ID
 */
extern const unsigned short             _REVID              __at(0x3FFFFC);

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// NCO1ACCU<ACC16>
extern volatile __bit                   ACC16               __at(0x2210);	// @ (0x442 * 8 + 0)
#define                                 ACC16_bit           _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<ACC17>
extern volatile __bit                   ACC17               __at(0x2211);	// @ (0x442 * 8 + 1)
#define                                 ACC17_bit           _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<ACC18>
extern volatile __bit                   ACC18               __at(0x2212);	// @ (0x442 * 8 + 2)
#define                                 ACC18_bit           _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<ACC19>
extern volatile __bit                   ACC19               __at(0x2213);	// @ (0x442 * 8 + 3)
#define                                 ACC19_bit           _BIT_ACCESS(NCO1ACCU,3)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x1AB4);	// @ (0x356 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// CRCCON0<ACCMOD>
extern volatile __bit                   ACCMOD              __at(0x1AB4);	// @ (0x356 * 8 + 4)
#define                                 ACCMOD_bit          _BIT_ACCESS(CRCCON0,4)
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 ACKT1IE_bit         _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0x14CE);	// @ (0x299 * 8 + 6)
#define                                 ACKT1IF_bit         _BIT_ACCESS(I2C1PIR,6)
// I2C2PIE<ACKT2IE>
extern volatile __bit                   ACKT2IE             __at(0x158E);	// @ (0x2B1 * 8 + 6)
#define                                 ACKT2IE_bit         _BIT_ACCESS(I2C2PIE,6)
// I2C2PIR<ACKT2IF>
extern volatile __bit                   ACKT2IF             __at(0x1586);	// @ (0x2B0 * 8 + 6)
#define                                 ACKT2IF_bit         _BIT_ACCESS(I2C2PIR,6)
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x1FAB);	// @ (0x3F5 * 8 + 3)
#define                                 ACLR_bit            _BIT_ACCESS(ADCON2,3)
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1F70);	// @ (0x3EE * 8 + 0)
#define                                 ACQ0_bit            _BIT_ACCESS(ADACQL,0)
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1F71);	// @ (0x3EE * 8 + 1)
#define                                 ACQ1_bit            _BIT_ACCESS(ADACQL,1)
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x1F7A);	// @ (0x3EF * 8 + 2)
#define                                 ACQ10_bit           _BIT_ACCESS(ADACQH,2)
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x1F7B);	// @ (0x3EF * 8 + 3)
#define                                 ACQ11_bit           _BIT_ACCESS(ADACQH,3)
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x1F7C);	// @ (0x3EF * 8 + 4)
#define                                 ACQ12_bit           _BIT_ACCESS(ADACQH,4)
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1F72);	// @ (0x3EE * 8 + 2)
#define                                 ACQ2_bit            _BIT_ACCESS(ADACQL,2)
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1F73);	// @ (0x3EE * 8 + 3)
#define                                 ACQ3_bit            _BIT_ACCESS(ADACQL,3)
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1F74);	// @ (0x3EE * 8 + 4)
#define                                 ACQ4_bit            _BIT_ACCESS(ADACQL,4)
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1F75);	// @ (0x3EE * 8 + 5)
#define                                 ACQ5_bit            _BIT_ACCESS(ADACQL,5)
// ADACQL<ACQ6>
extern volatile __bit                   ACQ6                __at(0x1F76);	// @ (0x3EE * 8 + 6)
#define                                 ACQ6_bit            _BIT_ACCESS(ADACQL,6)
// ADACQL<ACQ7>
extern volatile __bit                   ACQ7                __at(0x1F77);	// @ (0x3EE * 8 + 7)
#define                                 ACQ7_bit            _BIT_ACCESS(ADACQL,7)
// ADACQH<ACQ8>
extern volatile __bit                   ACQ8                __at(0x1F78);	// @ (0x3EF * 8 + 0)
#define                                 ACQ8_bit            _BIT_ACCESS(ADACQH,0)
// ADACQH<ACQ9>
extern volatile __bit                   ACQ9                __at(0x1F79);	// @ (0x3EF * 8 + 1)
#define                                 ACQ9_bit            _BIT_ACCESS(ADACQH,1)
// ADACT<ACT0>
extern volatile __bit                   ACT0                __at(0x1FC8);	// @ (0x3F9 * 8 + 0)
#define                                 ACT0_bit            _BIT_ACCESS(ADACT,0)
// ADACT<ACT1>
extern volatile __bit                   ACT1                __at(0x1FC9);	// @ (0x3F9 * 8 + 1)
#define                                 ACT1_bit            _BIT_ACCESS(ADACT,1)
// ADACT<ACT2>
extern volatile __bit                   ACT2                __at(0x1FCA);	// @ (0x3F9 * 8 + 2)
#define                                 ACT2_bit            _BIT_ACCESS(ADACT,2)
// ADACT<ACT3>
extern volatile __bit                   ACT3                __at(0x1FCB);	// @ (0x3F9 * 8 + 3)
#define                                 ACT3_bit            _BIT_ACCESS(ADACT,3)
// ADACT<ACT4>
extern volatile __bit                   ACT4                __at(0x1FCC);	// @ (0x3F9 * 8 + 4)
#define                                 ACT4_bit            _BIT_ACCESS(ADACT,4)
// ADACT<ACT5>
extern volatile __bit                   ACT5                __at(0x1FCD);	// @ (0x3F9 * 8 + 5)
#define                                 ACT5_bit            _BIT_ACCESS(ADACT,5)
// ACTCON<ACTEN>
extern volatile __bit                   ACTEN               __at(0x567);	// @ (0xAC * 8 + 7)
#define                                 ACTEN_bit           _BIT_ACCESS(ACTCON,7)
// PIE1<ACTIE>
extern volatile __bit                   ACTIE               __at(0x255B);	// @ (0x4AB * 8 + 3)
#define                                 ACTIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<ACTIF>
extern volatile __bit                   ACTIF               __at(0x25BB);	// @ (0x4B7 * 8 + 3)
#define                                 ACTIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<ACTIP>
extern volatile __bit                   ACTIP               __at(0x24FB);	// @ (0x49F * 8 + 3)
#define                                 ACTIP_bit           _BIT_ACCESS(IPR1,3)
// ACTCON<ACTLOCK>
extern volatile __bit                   ACTLOCK             __at(0x563);	// @ (0xAC * 8 + 3)
#define                                 ACTLOCK_bit         _BIT_ACCESS(ACTCON,3)
// PMD2<ACTMD>
extern volatile __bit                   ACTMD               __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 ACTMD_bit           _BIT_ACCESS(PMD2,3)
// ACTCON<ACTORS>
extern volatile __bit                   ACTORS              __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ACTORS_bit          _BIT_ACCESS(ACTCON,1)
// ACTCON<ACTUD>
extern volatile __bit                   ACTUD               __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 ACTUD_bit           _BIT_ACCESS(ACTCON,6)
// IVTADL<AD0>
extern volatile __bit                   AD0                 __at(0x22D0);	// @ (0x45A * 8 + 0)
#define                                 AD0_bit             _BIT_ACCESS(IVTADL,0)
// IVTADL<AD1>
extern volatile __bit                   AD1                 __at(0x22D1);	// @ (0x45A * 8 + 1)
#define                                 AD1_bit             _BIT_ACCESS(IVTADL,1)
// IVTADH<AD10>
extern volatile __bit                   AD10                __at(0x22DA);	// @ (0x45B * 8 + 2)
#define                                 AD10_bit            _BIT_ACCESS(IVTADH,2)
// IVTADH<AD11>
extern volatile __bit                   AD11                __at(0x22DB);	// @ (0x45B * 8 + 3)
#define                                 AD11_bit            _BIT_ACCESS(IVTADH,3)
// IVTADH<AD12>
extern volatile __bit                   AD12                __at(0x22DC);	// @ (0x45B * 8 + 4)
#define                                 AD12_bit            _BIT_ACCESS(IVTADH,4)
// IVTADH<AD13>
extern volatile __bit                   AD13                __at(0x22DD);	// @ (0x45B * 8 + 5)
#define                                 AD13_bit            _BIT_ACCESS(IVTADH,5)
// IVTADH<AD14>
extern volatile __bit                   AD14                __at(0x22DE);	// @ (0x45B * 8 + 6)
#define                                 AD14_bit            _BIT_ACCESS(IVTADH,6)
// IVTADH<AD15>
extern volatile __bit                   AD15                __at(0x22DF);	// @ (0x45B * 8 + 7)
#define                                 AD15_bit            _BIT_ACCESS(IVTADH,7)
// IVTADU<AD16>
extern volatile __bit                   AD16                __at(0x22E0);	// @ (0x45C * 8 + 0)
#define                                 AD16_bit            _BIT_ACCESS(IVTADU,0)
// IVTADU<AD17>
extern volatile __bit                   AD17                __at(0x22E1);	// @ (0x45C * 8 + 1)
#define                                 AD17_bit            _BIT_ACCESS(IVTADU,1)
// IVTADU<AD18>
extern volatile __bit                   AD18                __at(0x22E2);	// @ (0x45C * 8 + 2)
#define                                 AD18_bit            _BIT_ACCESS(IVTADU,2)
// IVTADU<AD19>
extern volatile __bit                   AD19                __at(0x22E3);	// @ (0x45C * 8 + 3)
#define                                 AD19_bit            _BIT_ACCESS(IVTADU,3)
// IVTADL<AD2>
extern volatile __bit                   AD2                 __at(0x22D2);	// @ (0x45A * 8 + 2)
#define                                 AD2_bit             _BIT_ACCESS(IVTADL,2)
// IVTADU<AD20>
extern volatile __bit                   AD20                __at(0x22E4);	// @ (0x45C * 8 + 4)
#define                                 AD20_bit            _BIT_ACCESS(IVTADU,4)
// IVTADL<AD3>
extern volatile __bit                   AD3                 __at(0x22D3);	// @ (0x45A * 8 + 3)
#define                                 AD3_bit             _BIT_ACCESS(IVTADL,3)
// IVTADL<AD4>
extern volatile __bit                   AD4                 __at(0x22D4);	// @ (0x45A * 8 + 4)
#define                                 AD4_bit             _BIT_ACCESS(IVTADL,4)
// IVTADL<AD5>
extern volatile __bit                   AD5                 __at(0x22D5);	// @ (0x45A * 8 + 5)
#define                                 AD5_bit             _BIT_ACCESS(IVTADL,5)
// IVTADL<AD6>
extern volatile __bit                   AD6                 __at(0x22D6);	// @ (0x45A * 8 + 6)
#define                                 AD6_bit             _BIT_ACCESS(IVTADL,6)
// IVTADL<AD7>
extern volatile __bit                   AD7                 __at(0x22D7);	// @ (0x45A * 8 + 7)
#define                                 AD7_bit             _BIT_ACCESS(IVTADL,7)
// IVTADH<AD8>
extern volatile __bit                   AD8                 __at(0x22D8);	// @ (0x45B * 8 + 0)
#define                                 AD8_bit             _BIT_ACCESS(IVTADH,0)
// IVTADH<AD9>
extern volatile __bit                   AD9                 __at(0x22D9);	// @ (0x45B * 8 + 1)
#define                                 AD9_bit             _BIT_ACCESS(IVTADH,1)
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x1F18);	// @ (0x3E3 * 8 + 0)
#define                                 ADACC0_bit          _BIT_ACCESS(ADACCL,0)
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x1F19);	// @ (0x3E3 * 8 + 1)
#define                                 ADACC1_bit          _BIT_ACCESS(ADACCL,1)
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x1F22);	// @ (0x3E4 * 8 + 2)
#define                                 ADACC10_bit         _BIT_ACCESS(ADACCH,2)
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x1F23);	// @ (0x3E4 * 8 + 3)
#define                                 ADACC11_bit         _BIT_ACCESS(ADACCH,3)
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x1F24);	// @ (0x3E4 * 8 + 4)
#define                                 ADACC12_bit         _BIT_ACCESS(ADACCH,4)
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x1F25);	// @ (0x3E4 * 8 + 5)
#define                                 ADACC13_bit         _BIT_ACCESS(ADACCH,5)
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x1F26);	// @ (0x3E4 * 8 + 6)
#define                                 ADACC14_bit         _BIT_ACCESS(ADACCH,6)
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x1F27);	// @ (0x3E4 * 8 + 7)
#define                                 ADACC15_bit         _BIT_ACCESS(ADACCH,7)
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x1F1A);	// @ (0x3E3 * 8 + 2)
#define                                 ADACC2_bit          _BIT_ACCESS(ADACCL,2)
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x1F1B);	// @ (0x3E3 * 8 + 3)
#define                                 ADACC3_bit          _BIT_ACCESS(ADACCL,3)
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x1F1C);	// @ (0x3E3 * 8 + 4)
#define                                 ADACC4_bit          _BIT_ACCESS(ADACCL,4)
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x1F1D);	// @ (0x3E3 * 8 + 5)
#define                                 ADACC5_bit          _BIT_ACCESS(ADACCL,5)
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x1F1E);	// @ (0x3E3 * 8 + 6)
#define                                 ADACC6_bit          _BIT_ACCESS(ADACCL,6)
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x1F1F);	// @ (0x3E3 * 8 + 7)
#define                                 ADACC7_bit          _BIT_ACCESS(ADACCL,7)
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x1F20);	// @ (0x3E4 * 8 + 0)
#define                                 ADACC8_bit          _BIT_ACCESS(ADACCH,0)
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x1F21);	// @ (0x3E4 * 8 + 1)
#define                                 ADACC9_bit          _BIT_ACCESS(ADACCH,1)
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x1FAB);	// @ (0x3F5 * 8 + 3)
#define                                 ADACLR_bit          _BIT_ACCESS(ADCON2,3)
// ADACQL<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x1F70);	// @ (0x3EE * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(ADACQL,0)
// ADACQL<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x1F71);	// @ (0x3EE * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(ADACQL,1)
// ADACQH<ADACQ10>
extern volatile __bit                   ADACQ10             __at(0x1F7A);	// @ (0x3EF * 8 + 2)
#define                                 ADACQ10_bit         _BIT_ACCESS(ADACQH,2)
// ADACQH<ADACQ11>
extern volatile __bit                   ADACQ11             __at(0x1F7B);	// @ (0x3EF * 8 + 3)
#define                                 ADACQ11_bit         _BIT_ACCESS(ADACQH,3)
// ADACQH<ADACQ12>
extern volatile __bit                   ADACQ12             __at(0x1F7C);	// @ (0x3EF * 8 + 4)
#define                                 ADACQ12_bit         _BIT_ACCESS(ADACQH,4)
// ADACQL<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x1F72);	// @ (0x3EE * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(ADACQL,2)
// ADACQL<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x1F73);	// @ (0x3EE * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(ADACQL,3)
// ADACQL<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x1F74);	// @ (0x3EE * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(ADACQL,4)
// ADACQL<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x1F75);	// @ (0x3EE * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(ADACQL,5)
// ADACQL<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x1F76);	// @ (0x3EE * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(ADACQL,6)
// ADACQL<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x1F77);	// @ (0x3EE * 8 + 7)
#define                                 ADACQ7_bit          _BIT_ACCESS(ADACQL,7)
// ADACQH<ADACQ8>
extern volatile __bit                   ADACQ8              __at(0x1F78);	// @ (0x3EF * 8 + 0)
#define                                 ADACQ8_bit          _BIT_ACCESS(ADACQH,0)
// ADACQH<ADACQ9>
extern volatile __bit                   ADACQ9              __at(0x1F79);	// @ (0x3EF * 8 + 1)
#define                                 ADACQ9_bit          _BIT_ACCESS(ADACQH,1)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x1FC8);	// @ (0x3F9 * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x1FC9);	// @ (0x3F9 * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x1FCA);	// @ (0x3F9 * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x1FCB);	// @ (0x3F9 * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x1FCC);	// @ (0x3F9 * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACT<ADACT5>
extern volatile __bit                   ADACT5              __at(0x1FCD);	// @ (0x3F9 * 8 + 5)
