garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
// PIR6<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x25E7);	// @ (0x4BC * 8 + 7)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x2527);	// @ (0x4A4 * 8 + 7)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR6,7)
// PIE6<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x2585);	// @ (0x4B0 * 8 + 5)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE6,5)
// PIR6<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x25E5);	// @ (0x4BC * 8 + 5)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR6,5)
// IPR6<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x2525);	// @ (0x4A4 * 8 + 5)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR6,5)
// PMD4<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD4,6)
// PIE6<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x2586);	// @ (0x4B0 * 8 + 6)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE6,6)
// PIR6<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x25E6);	// @ (0x4BC * 8 + 6)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR6,6)
// IPR6<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x2526);	// @ (0x4A4 * 8 + 6)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR6,6)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x5B8);	// @ (0xB7 * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x5B9);	// @ (0xB7 * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x5BA);	// @ (0xB7 * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// PIE6<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x2584);	// @ (0x4B0 * 8 + 4)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE6,4)
// PIR6<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x25E4);	// @ (0x4BC * 8 + 4)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR6,4)
// IPR6<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x2524);	// @ (0x4A4 * 8 + 4)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR6,4)
// PIE9<DMA3AIE>
extern volatile __bit                   DMA3AIE             __at(0x259F);	// @ (0x4B3 * 8 + 7)
#define                                 DMA3AIE_bit         _BIT_ACCESS(PIE9,7)
// PIR9<DMA3AIF>
extern volatile __bit                   DMA3AIF             __at(0x25FF);	// @ (0x4BF * 8 + 7)
#define                                 DMA3AIF_bit         _BIT_ACCESS(PIR9,7)
// IPR9<DMA3AIP>
extern volatile __bit                   DMA3AIP             __at(0x253F);	// @ (0x4A7 * 8 + 7)
#define                                 DMA3AIP_bit         _BIT_ACCESS(IPR9,7)
// PIE9<DMA3DCNTIE>
extern volatile __bit                   DMA3DCNTIE          __at(0x259D);	// @ (0x4B3 * 8 + 5)
#define                                 DMA3DCNTIE_bit      _BIT_ACCESS(PIE9,5)
// PIR9<DMA3DCNTIF>
extern volatile __bit                   DMA3DCNTIF          __at(0x25FD);	// @ (0x4BF * 8 + 5)
#define                                 DMA3DCNTIF_bit      _BIT_ACCESS(PIR9,5)
// IPR9<DMA3DCNTIP>
extern volatile __bit                   DMA3DCNTIP          __at(0x253D);	// @ (0x4A7 * 8 + 5)
#define                                 DMA3DCNTIP_bit      _BIT_ACCESS(IPR9,5)
// PMD4<DMA3MD>
extern volatile __bit                   DMA3MD              __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 DMA3MD_bit          _BIT_ACCESS(PMD4,7)
// PIE9<DMA3ORIE>
extern volatile __bit                   DMA3ORIE            __at(0x259E);	// @ (0x4B3 * 8 + 6)
#define                                 DMA3ORIE_bit        _BIT_ACCESS(PIE9,6)
// PIR9<DMA3ORIF>
extern volatile __bit                   DMA3ORIF            __at(0x25FE);	// @ (0x4BF * 8 + 6)
#define                                 DMA3ORIF_bit        _BIT_ACCESS(PIR9,6)
// IPR9<DMA3ORIP>
extern volatile __bit                   DMA3ORIP            __at(0x253E);	// @ (0x4A7 * 8 + 6)
#define                                 DMA3ORIP_bit        _BIT_ACCESS(IPR9,6)
// DMA3PR<DMA3PR0>
extern volatile __bit                   DMA3PR0             __at(0x5C0);	// @ (0xB8 * 8 + 0)
#define                                 DMA3PR0_bit         _BIT_ACCESS(DMA3PR,0)
// DMA3PR<DMA3PR1>
extern volatile __bit                   DMA3PR1             __at(0x5C1);	// @ (0xB8 * 8 + 1)
#define                                 DMA3PR1_bit         _BIT_ACCESS(DMA3PR,1)
// DMA3PR<DMA3PR2>
extern volatile __bit                   DMA3PR2             __at(0x5C2);	// @ (0xB8 * 8 + 2)
#define                                 DMA3PR2_bit         _BIT_ACCESS(DMA3PR,2)
// PIE9<DMA3SCNTIE>
extern volatile __bit                   DMA3SCNTIE          __at(0x259C);	// @ (0x4B3 * 8 + 4)
#define                                 DMA3SCNTIE_bit      _BIT_ACCESS(PIE9,4)
// PIR9<DMA3SCNTIF>
extern volatile __bit                   DMA3SCNTIF          __at(0x25FC);	// @ (0x4BF * 8 + 4)
#define                                 DMA3SCNTIF_bit      _BIT_ACCESS(PIR9,4)
// IPR9<DMA3SCNTIP>
extern volatile __bit                   DMA3SCNTIP          __at(0x253C);	// @ (0x4A7 * 8 + 4)
#define                                 DMA3SCNTIP_bit      _BIT_ACCESS(IPR9,4)
// PIE10<DMA4AIE>
extern volatile __bit                   DMA4AIE             __at(0x25A7);	// @ (0x4B4 * 8 + 7)
#define                                 DMA4AIE_bit         _BIT_ACCESS(PIE10,7)
// PIR10<DMA4AIF>
extern volatile __bit                   DMA4AIF             __at(0x2607);	// @ (0x4C0 * 8 + 7)
#define                                 DMA4AIF_bit         _BIT_ACCESS(PIR10,7)
// IPR10<DMA4AIP>
extern volatile __bit                   DMA4AIP             __at(0x2547);	// @ (0x4A8 * 8 + 7)
#define                                 DMA4AIP_bit         _BIT_ACCESS(IPR10,7)
// PIE10<DMA4DCNTIE>
extern volatile __bit                   DMA4DCNTIE          __at(0x25A5);	// @ (0x4B4 * 8 + 5)
#define                                 DMA4DCNTIE_bit      _BIT_ACCESS(PIE10,5)
// PIR10<DMA4DCNTIF>
extern volatile __bit                   DMA4DCNTIF          __at(0x2605);	// @ (0x4C0 * 8 + 5)
#define                                 DMA4DCNTIF_bit      _BIT_ACCESS(PIR10,5)
// IPR10<DMA4DCNTIP>
extern volatile __bit                   DMA4DCNTIP          __at(0x2545);	// @ (0x4A8 * 8 + 5)
#define                                 DMA4DCNTIP_bit      _BIT_ACCESS(IPR10,5)
// PMD5<DMA4MD>
extern volatile __bit                   DMA4MD              __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 DMA4MD_bit          _BIT_ACCESS(PMD5,3)
// PIE10<DMA4ORIE>
extern volatile __bit                   DMA4ORIE            __at(0x25A6);	// @ (0x4B4 * 8 + 6)
#define                                 DMA4ORIE_bit        _BIT_ACCESS(PIE10,6)
// PIR10<DMA4ORIF>
extern volatile __bit                   DMA4ORIF            __at(0x2606);	// @ (0x4C0 * 8 + 6)
#define                                 DMA4ORIF_bit        _BIT_ACCESS(PIR10,6)
// IPR10<DMA4ORIP>
extern volatile __bit                   DMA4ORIP            __at(0x2546);	// @ (0x4A8 * 8 + 6)
#define                                 DMA4ORIP_bit        _BIT_ACCESS(IPR10,6)
// DMA4PR<DMA4PR0>
extern volatile __bit                   DMA4PR0             __at(0x5C8);	// @ (0xB9 * 8 + 0)
#define                                 DMA4PR0_bit         _BIT_ACCESS(DMA4PR,0)
// DMA4PR<DMA4PR1>
extern volatile __bit                   DMA4PR1             __at(0x5C9);	// @ (0xB9 * 8 + 1)
#define                                 DMA4PR1_bit         _BIT_ACCESS(DMA4PR,1)
// DMA4PR<DMA4PR2>
extern volatile __bit                   DMA4PR2             __at(0x5CA);	// @ (0xB9 * 8 + 2)
#define                                 DMA4PR2_bit         _BIT_ACCESS(DMA4PR,2)
// PIE10<DMA4SCNTIE>
extern volatile __bit                   DMA4SCNTIE          __at(0x25A4);	// @ (0x4B4 * 8 + 4)
#define                                 DMA4SCNTIE_bit      _BIT_ACCESS(PIE10,4)
// PIR10<DMA4SCNTIF>
extern volatile __bit                   DMA4SCNTIF          __at(0x2604);	// @ (0x4C0 * 8 + 4)
#define                                 DMA4SCNTIF_bit      _BIT_ACCESS(PIR10,4)
// IPR10<DMA4SCNTIP>
extern volatile __bit                   DMA4SCNTIP          __at(0x2544);	// @ (0x4A8 * 8 + 4)
#define                                 DMA4SCNTIP_bit      _BIT_ACCESS(IPR10,4)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x2794);	// @ (0x4F2 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1F98);	// @ (0x3F3 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x2790);	// @ (0x4F2 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x2791);	// @ (0x4F2 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x2792);	// @ (0x4F2 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x2796);	// @ (0x4F2 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// DMAnDPTRL<DPTR0>
extern volatile __bit                   DPTR0               __at(0x758);	// @ (0xEB * 8 + 0)
#define                                 DPTR0_bit           _BIT_ACCESS(DMAnDPTRL,0)
// DMAnDPTRL<DPTR1>
extern volatile __bit                   DPTR1               __at(0x759);	// @ (0xEB * 8 + 1)
#define                                 DPTR1_bit           _BIT_ACCESS(DMAnDPTRL,1)
// DMAnDPTRH<DPTR10>
extern volatile __bit                   DPTR10              __at(0x762);	// @ (0xEC * 8 + 2)
#define                                 DPTR10_bit          _BIT_ACCESS(DMAnDPTRH,2)
// DMAnDPTRH<DPTR11>
extern volatile __bit                   DPTR11              __at(0x763);	// @ (0xEC * 8 + 3)
#define                                 DPTR11_bit          _BIT_ACCESS(DMAnDPTRH,3)
// DMAnDPTRH<DPTR12>
extern volatile __bit                   DPTR12              __at(0x764);	// @ (0xEC * 8 + 4)
#define                                 DPTR12_bit          _BIT_ACCESS(DMAnDPTRH,4)
// DMAnDPTRH<DPTR13>
extern volatile __bit                   DPTR13              __at(0x765);	// @ (0xEC * 8 + 5)
#define                                 DPTR13_bit          _BIT_ACCESS(DMAnDPTRH,5)
// DMAnDPTRH<DPTR14>
extern volatile __bit                   DPTR14              __at(0x766);	// @ (0xEC * 8 + 6)
#define                                 DPTR14_bit          _BIT_ACCESS(DMAnDPTRH,6)
// DMAnDPTRH<DPTR15>
extern volatile __bit                   DPTR15              __at(0x767);	// @ (0xEC * 8 + 7)
#define                                 DPTR15_bit          _BIT_ACCESS(DMAnDPTRH,7)
// DMAnDPTRL<DPTR2>
extern volatile __bit                   DPTR2               __at(0x75A);	// @ (0xEB * 8 + 2)
#define                                 DPTR2_bit           _BIT_ACCESS(DMAnDPTRL,2)
// DMAnDPTRL<DPTR3>
extern volatile __bit                   DPTR3               __at(0x75B);	// @ (0xEB * 8 + 3)
#define                                 DPTR3_bit           _BIT_ACCESS(DMAnDPTRL,3)
// DMAnDPTRL<DPTR4>
extern volatile __bit                   DPTR4               __at(0x75C);	// @ (0xEB * 8 + 4)
#define                                 DPTR4_bit           _BIT_ACCESS(DMAnDPTRL,4)
// DMAnDPTRL<DPTR5>
extern volatile __bit                   DPTR5               __at(0x75D);	// @ (0xEB * 8 + 5)
#define                                 DPTR5_bit           _BIT_ACCESS(DMAnDPTRL,5)
// DMAnDPTRL<DPTR6>
extern volatile __bit                   DPTR6               __at(0x75E);	// @ (0xEB * 8 + 6)
#define                                 DPTR6_bit           _BIT_ACCESS(DMAnDPTRL,6)
// DMAnDPTRL<DPTR7>
extern volatile __bit                   DPTR7               __at(0x75F);	// @ (0xEB * 8 + 7)
#define                                 DPTR7_bit           _BIT_ACCESS(DMAnDPTRL,7)
// DMAnDPTRH<DPTR8>
extern volatile __bit                   DPTR8               __at(0x760);	// @ (0xEC * 8 + 0)
#define                                 DPTR8_bit           _BIT_ACCESS(DMAnDPTRH,0)
// DMAnDPTRH<DPTR9>
extern volatile __bit                   DPTR9               __at(0x761);	// @ (0xEC * 8 + 1)
#define                                 DPTR9_bit           _BIT_ACCESS(DMAnDPTRH,1)
// DMAnDSAL<DSA0>
extern volatile __bit                   DSA0                __at(0x778);	// @ (0xEF * 8 + 0)
#define                                 DSA0_bit            _BIT_ACCESS(DMAnDSAL,0)
// DMAnDSAL<DSA1>
extern volatile __bit                   DSA1                __at(0x779);	// @ (0xEF * 8 + 1)
#define                                 DSA1_bit            _BIT_ACCESS(DMAnDSAL,1)
// DMAnDSAH<DSA10>
extern volatile __bit                   DSA10               __at(0x782);	// @ (0xF0 * 8 + 2)
#define                                 DSA10_bit           _BIT_ACCESS(DMAnDSAH,2)
// DMAnDSAH<DSA11>
extern volatile __bit                   DSA11               __at(0x783);	// @ (0xF0 * 8 + 3)
#define                                 DSA11_bit           _BIT_ACCESS(DMAnDSAH,3)
// DMAnDSAH<DSA12>
extern volatile __bit                   DSA12               __at(0x784);	// @ (0xF0 * 8 + 4)
#define                                 DSA12_bit           _BIT_ACCESS(DMAnDSAH,4)
// DMAnDSAH<DSA13>
extern volatile __bit                   DSA13               __at(0x785);	// @ (0xF0 * 8 + 5)
#define                                 DSA13_bit           _BIT_ACCESS(DMAnDSAH,5)
// DMAnDSAH<DSA14>
extern volatile __bit                   DSA14               __at(0x786);	// @ (0xF0 * 8 + 6)
#define                                 DSA14_bit           _BIT_ACCESS(DMAnDSAH,6)
// DMAnDSAH<DSA15>
extern volatile __bit                   DSA15               __at(0x787);	// @ (0xF0 * 8 + 7)
#define                                 DSA15_bit           _BIT_ACCESS(DMAnDSAH,7)
// DMAnDSAL<DSA2>
extern volatile __bit                   DSA2                __at(0x77A);	// @ (0xEF * 8 + 2)
#define                                 DSA2_bit            _BIT_ACCESS(DMAnDSAL,2)
// DMAnDSAL<DSA3>
extern volatile __bit                   DSA3                __at(0x77B);	// @ (0xEF * 8 + 3)
#define                                 DSA3_bit            _BIT_ACCESS(DMAnDSAL,3)
// DMAnDSAL<DSA4>
extern volatile __bit                   DSA4                __at(0x77C);	// @ (0xEF * 8 + 4)
#define                                 DSA4_bit            _BIT_ACCESS(DMAnDSAL,4)
// DMAnDSAL<DSA5>
extern volatile __bit                   DSA5                __at(0x77D);	// @ (0xEF * 8 + 5)
#define                                 DSA5_bit            _BIT_ACCESS(DMAnDSAL,5)
// DMAnDSAL<DSA6>
extern volatile __bit                   DSA6                __at(0x77E);	// @ (0xEF * 8 + 6)
#define                                 DSA6_bit            _BIT_ACCESS(DMAnDSAL,6)
// DMAnDSAL<DSA7>
extern volatile __bit                   DSA7                __at(0x77F);	// @ (0xEF * 8 + 7)
#define                                 DSA7_bit            _BIT_ACCESS(DMAnDSAL,7)
// DMAnDSAH<DSA8>
extern volatile __bit                   DSA8                __at(0x780);	// @ (0xF0 * 8 + 0)
#define                                 DSA8_bit            _BIT_ACCESS(DMAnDSAH,0)
// DMAnDSAH<DSA9>
extern volatile __bit                   DSA9                __at(0x781);	// @ (0xF0 * 8 + 1)
#define                                 DSA9_bit            _BIT_ACCESS(DMAnDSAH,1)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1FA0);	// @ (0x3F4 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// DMAnCON1<DSTP>
extern volatile __bit                   DSTP                __at(0x7E5);	// @ (0xFC * 8 + 5)
#define                                 DSTP_bit            _BIT_ACCESS(DMAnCON1,5)
// DMAnDSZL<DSZ0>
extern volatile __bit                   DSZ0                __at(0x768);	// @ (0xED * 8 + 0)
#define                                 DSZ0_bit            _BIT_ACCESS(DMAnDSZL,0)
// DMAnDSZL<DSZ1>
extern volatile __bit                   DSZ1                __at(0x769);	// @ (0xED * 8 + 1)
#define                                 DSZ1_bit            _BIT_ACCESS(DMAnDSZL,1)
// DMAnDSZH<DSZ10>
extern volatile __bit                   DSZ10               __at(0x772);	// @ (0xEE * 8 + 2)
#define                                 DSZ10_bit           _BIT_ACCESS(DMAnDSZH,2)
// DMAnDSZH<DSZ11>
extern volatile __bit                   DSZ11               __at(0x773);	// @ (0xEE * 8 + 3)
#define                                 DSZ11_bit           _BIT_ACCESS(DMAnDSZH,3)
// DMAnDSZL<DSZ2>
extern volatile __bit                   DSZ2                __at(0x76A);	// @ (0xED * 8 + 2)
#define                                 DSZ2_bit            _BIT_ACCESS(DMAnDSZL,2)
// DMAnDSZL<DSZ3>
extern volatile __bit                   DSZ3                __at(0x76B);	// @ (0xED * 8 + 3)
#define                                 DSZ3_bit            _BIT_ACCESS(DMAnDSZL,3)
// DMAnDSZL<DSZ4>
extern volatile __bit                   DSZ4                __at(0x76C);	// @ (0xED * 8 + 4)
#define                                 DSZ4_bit            _BIT_ACCESS(DMAnDSZL,4)
// DMAnDSZL<DSZ5>
extern volatile __bit                   DSZ5                __at(0x76D);	// @ (0xED * 8 + 5)
#define                                 DSZ5_bit            _BIT_ACCESS(DMAnDSZL,5)
// DMAnDSZL<DSZ6>
extern volatile __bit                   DSZ6                __at(0x76E);	// @ (0xED * 8 + 6)
#define                                 DSZ6_bit            _BIT_ACCESS(DMAnDSZL,6)
// DMAnDSZL<DSZ7>
extern volatile __bit                   DSZ7                __at(0x76F);	// @ (0xED * 8 + 7)
#define                                 DSZ7_bit            _BIT_ACCESS(DMAnDSZL,7)
// DMAnDSZH<DSZ8>
extern volatile __bit                   DSZ8                __at(0x770);	// @ (0xEE * 8 + 0)
#define                                 DSZ8_bit            _BIT_ACCESS(DMAnDSZH,0)
// DMAnDSZH<DSZ9>
extern volatile __bit                   DSZ9                __at(0x771);	// @ (0xEE * 8 + 1)
#define                                 DSZ9_bit            _BIT_ACCESS(DMAnDSZH,1)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x1EE8);	// @ (0x3DD * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x1EE9);	// @ (0x3DD * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x1EF2);	// @ (0x3DE * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x1EF3);	// @ (0x3DE * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x1EF4);	// @ (0x3DE * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x1EF5);	// @ (0x3DE * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x1EF6);	// @ (0x3DE * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x1EF7);	// @ (0x3DE * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x1EEA);	// @ (0x3DD * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x1EEB);	// @ (0x3DD * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x1EEC);	// @ (0x3DD * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x1EED);	// @ (0x3DD * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x1EEE);	// @ (0x3DD * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x1EEF);	// @ (0x3DD * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x1EF0);	// @ (0x3DE * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x1EF1);	// @ (0x3DE * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x59F);	// @ (0xB3 * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x597);	// @ (0xB2 * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x1F08);	// @ (0x3E1 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x1F09);	// @ (0x3E1 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x1F12);	// @ (0x3E2 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x1F13);	// @ (0x3E2 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x1F14);	// @ (0x3E2 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x1F15);	// @ (0x3E2 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
