garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
extern volatile __bit                   FLTR14              __at(0x1F16);	// @ (0x3E2 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x1F17);	// @ (0x3E2 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x1F0A);	// @ (0x3E1 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x1F0B);	// @ (0x3E1 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x1F0C);	// @ (0x3E1 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x1F0D);	// @ (0x3E1 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x1F0E);	// @ (0x3E1 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x1F0F);	// @ (0x3E1 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x1F10);	// @ (0x3E2 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x1F11);	// @ (0x3E2 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x1F9A);	// @ (0x3F3 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x588);	// @ (0xB1 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x589);	// @ (0xB1 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x58A);	// @ (0xB1 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x58B);	// @ (0xB1 * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// FSCMCON<FSCMFEV>
extern volatile __bit                   FSCMFEV             __at(0x22C0);	// @ (0x458 * 8 + 0)
#define                                 FSCMFEV_bit         _BIT_ACCESS(FSCMCON,0)
// FSCMCON<FSCMFFI>
extern volatile __bit                   FSCMFFI             __at(0x22C1);	// @ (0x458 * 8 + 1)
#define                                 FSCMFFI_bit         _BIT_ACCESS(FSCMCON,1)
// FSCMCON<FSCMPEV>
extern volatile __bit                   FSCMPEV             __at(0x22C2);	// @ (0x458 * 8 + 2)
#define                                 FSCMPEV_bit         _BIT_ACCESS(FSCMCON,2)
// FSCMCON<FSCMPFI>
extern volatile __bit                   FSCMPFI             __at(0x22C3);	// @ (0x458 * 8 + 3)
#define                                 FSCMPFI_bit         _BIT_ACCESS(FSCMCON,3)
// FSCMCON<FSCMSEV>
extern volatile __bit                   FSCMSEV             __at(0x22C4);	// @ (0x458 * 8 + 4)
#define                                 FSCMSEV_bit         _BIT_ACCESS(FSCMCON,4)
// FSCMCON<FSCMSFI>
extern volatile __bit                   FSCMSFI             __at(0x22C5);	// @ (0x458 * 8 + 5)
#define                                 FSCMSFI_bit         _BIT_ACCESS(FSCMCON,5)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x1AB0);	// @ (0x356 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x1EBF);	// @ (0x3D7 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x316);	// @ (0x62 * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x1EBE);	// @ (0x3D7 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CLCnGLS0<G1D1N>
extern volatile __bit                   G1D1N               __at(0x6E0);	// @ (0xDC * 8 + 0)
#define                                 G1D1N_bit           _BIT_ACCESS(CLCnGLS0,0)
// CLCnGLS0<G1D1T>
extern volatile __bit                   G1D1T               __at(0x6E1);	// @ (0xDC * 8 + 1)
#define                                 G1D1T_bit           _BIT_ACCESS(CLCnGLS0,1)
// CLCnGLS0<G1D2N>
extern volatile __bit                   G1D2N               __at(0x6E2);	// @ (0xDC * 8 + 2)
#define                                 G1D2N_bit           _BIT_ACCESS(CLCnGLS0,2)
// CLCnGLS0<G1D2T>
extern volatile __bit                   G1D2T               __at(0x6E3);	// @ (0xDC * 8 + 3)
#define                                 G1D2T_bit           _BIT_ACCESS(CLCnGLS0,3)
// CLCnGLS0<G1D3N>
extern volatile __bit                   G1D3N               __at(0x6E4);	// @ (0xDC * 8 + 4)
#define                                 G1D3N_bit           _BIT_ACCESS(CLCnGLS0,4)
// CLCnGLS0<G1D3T>
extern volatile __bit                   G1D3T               __at(0x6E5);	// @ (0xDC * 8 + 5)
#define                                 G1D3T_bit           _BIT_ACCESS(CLCnGLS0,5)
// CLCnGLS0<G1D4N>
extern volatile __bit                   G1D4N               __at(0x6E6);	// @ (0xDC * 8 + 6)
#define                                 G1D4N_bit           _BIT_ACCESS(CLCnGLS0,6)
// CLCnGLS0<G1D4T>
extern volatile __bit                   G1D4T               __at(0x6E7);	// @ (0xDC * 8 + 7)
#define                                 G1D4T_bit           _BIT_ACCESS(CLCnGLS0,7)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x1E07);	// @ (0x3C0 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CLCnPOL<G1POL>
extern volatile __bit                   G1POL               __at(0x6B8);	// @ (0xD7 * 8 + 0)
#define                                 G1POL_bit           _BIT_ACCESS(CLCnPOL,0)
// CLCnGLS1<G2D1N>
extern volatile __bit                   G2D1N               __at(0x6E8);	// @ (0xDD * 8 + 0)
#define                                 G2D1N_bit           _BIT_ACCESS(CLCnGLS1,0)
// CLCnGLS1<G2D1T>
extern volatile __bit                   G2D1T               __at(0x6E9);	// @ (0xDD * 8 + 1)
#define                                 G2D1T_bit           _BIT_ACCESS(CLCnGLS1,1)
// CLCnGLS1<G2D2N>
extern volatile __bit                   G2D2N               __at(0x6EA);	// @ (0xDD * 8 + 2)
#define                                 G2D2N_bit           _BIT_ACCESS(CLCnGLS1,2)
// CLCnGLS1<G2D2T>
extern volatile __bit                   G2D2T               __at(0x6EB);	// @ (0xDD * 8 + 3)
#define                                 G2D2T_bit           _BIT_ACCESS(CLCnGLS1,3)
// CLCnGLS1<G2D3N>
extern volatile __bit                   G2D3N               __at(0x6EC);	// @ (0xDD * 8 + 4)
#define                                 G2D3N_bit           _BIT_ACCESS(CLCnGLS1,4)
// CLCnGLS1<G2D3T>
extern volatile __bit                   G2D3T               __at(0x6ED);	// @ (0xDD * 8 + 5)
#define                                 G2D3T_bit           _BIT_ACCESS(CLCnGLS1,5)
// CLCnGLS1<G2D4N>
extern volatile __bit                   G2D4N               __at(0x6EE);	// @ (0xDD * 8 + 6)
#define                                 G2D4N_bit           _BIT_ACCESS(CLCnGLS1,6)
// CLCnGLS1<G2D4T>
extern volatile __bit                   G2D4T               __at(0x6EF);	// @ (0xDD * 8 + 7)
#define                                 G2D4T_bit           _BIT_ACCESS(CLCnGLS1,7)
// CLCnPOL<G2POL>
extern volatile __bit                   G2POL               __at(0x6B9);	// @ (0xD7 * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLCnPOL,1)
// CLCnGLS2<G3D1N>
extern volatile __bit                   G3D1N               __at(0x6F0);	// @ (0xDE * 8 + 0)
#define                                 G3D1N_bit           _BIT_ACCESS(CLCnGLS2,0)
// CLCnGLS2<G3D1T>
extern volatile __bit                   G3D1T               __at(0x6F1);	// @ (0xDE * 8 + 1)
#define                                 G3D1T_bit           _BIT_ACCESS(CLCnGLS2,1)
// CLCnGLS2<G3D2N>
extern volatile __bit                   G3D2N               __at(0x6F2);	// @ (0xDE * 8 + 2)
#define                                 G3D2N_bit           _BIT_ACCESS(CLCnGLS2,2)
// CLCnGLS2<G3D2T>
extern volatile __bit                   G3D2T               __at(0x6F3);	// @ (0xDE * 8 + 3)
#define                                 G3D2T_bit           _BIT_ACCESS(CLCnGLS2,3)
// CLCnGLS2<G3D3N>
extern volatile __bit                   G3D3N               __at(0x6F4);	// @ (0xDE * 8 + 4)
#define                                 G3D3N_bit           _BIT_ACCESS(CLCnGLS2,4)
// CLCnGLS2<G3D3T>
extern volatile __bit                   G3D3T               __at(0x6F5);	// @ (0xDE * 8 + 5)
#define                                 G3D3T_bit           _BIT_ACCESS(CLCnGLS2,5)
// CLCnGLS2<G3D4N>
extern volatile __bit                   G3D4N               __at(0x6F6);	// @ (0xDE * 8 + 6)
#define                                 G3D4N_bit           _BIT_ACCESS(CLCnGLS2,6)
// CLCnGLS2<G3D4T>
extern volatile __bit                   G3D4T               __at(0x6F7);	// @ (0xDE * 8 + 7)
#define                                 G3D4T_bit           _BIT_ACCESS(CLCnGLS2,7)
// CLCnPOL<G3POL>
extern volatile __bit                   G3POL               __at(0x6BA);	// @ (0xD7 * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLCnPOL,2)
// CLCnGLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0x6F8);	// @ (0xDF * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLCnGLS3,0)
// CLCnGLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0x6F9);	// @ (0xDF * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLCnGLS3,1)
// CLCnGLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0x6FA);	// @ (0xDF * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLCnGLS3,2)
// CLCnGLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0x6FB);	// @ (0xDF * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLCnGLS3,3)
// CLCnGLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0x6FC);	// @ (0xDF * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLCnGLS3,4)
// CLCnGLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0x6FD);	// @ (0xDF * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLCnGLS3,5)
// CLCnGLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0x6FE);	// @ (0xDF * 8 + 6)
#define                                 G4D4N_bit           _BIT_ACCESS(CLCnGLS3,6)
// CLCnGLS3<G4D4T>
extern volatile __bit                   G4D4T               __at(0x6FF);	// @ (0xDF * 8 + 7)
#define                                 G4D4T_bit           _BIT_ACCESS(CLCnGLS3,7)
// CLCnPOL<G4POL>
extern volatile __bit                   G4POL               __at(0x6BB);	// @ (0xD7 * 8 + 3)
#define                                 G4POL_bit           _BIT_ACCESS(CLCnPOL,3)
// INTCON0<GIE>
extern volatile __bit                   GIE                 __at(0x26B7);	// @ (0x4D6 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEH>
extern volatile __bit                   GIEH                __at(0x26B7);	// @ (0x4D6 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEL>
extern volatile __bit                   GIEL                __at(0x26B6);	// @ (0x4D6 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON0,6)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x1F98);	// @ (0x3F3 * 8 + 0)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,0)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x1F98);	// @ (0x3F3 * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// SCANHADRL<HADR0>
extern volatile __bit                   HADR0               __at(0x1AE8);	// @ (0x35D * 8 + 0)
#define                                 HADR0_bit           _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<HADR1>
extern volatile __bit                   HADR1               __at(0x1AE9);	// @ (0x35D * 8 + 1)
#define                                 HADR1_bit           _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<HADR10>
extern volatile __bit                   HADR10              __at(0x1AF2);	// @ (0x35E * 8 + 2)
#define                                 HADR10_bit          _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<HADR11>
extern volatile __bit                   HADR11              __at(0x1AF3);	// @ (0x35E * 8 + 3)
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x1AF4);	// @ (0x35E * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x1AF5);	// @ (0x35E * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x1AF6);	// @ (0x35E * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x1AF7);	// @ (0x35E * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<HADR16>
extern volatile __bit                   HADR16              __at(0x1AF8);	// @ (0x35F * 8 + 0)
#define                                 HADR16_bit          _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<HADR17>
extern volatile __bit                   HADR17              __at(0x1AF9);	// @ (0x35F * 8 + 1)
#define                                 HADR17_bit          _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<HADR18>
extern volatile __bit                   HADR18              __at(0x1AFA);	// @ (0x35F * 8 + 2)
#define                                 HADR18_bit          _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<HADR19>
extern volatile __bit                   HADR19              __at(0x1AFB);	// @ (0x35F * 8 + 3)
#define                                 HADR19_bit          _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<HADR2>
extern volatile __bit                   HADR2               __at(0x1AEA);	// @ (0x35D * 8 + 2)
#define                                 HADR2_bit           _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<HADR20>
extern volatile __bit                   HADR20              __at(0x1AFC);	// @ (0x35F * 8 + 4)
#define                                 HADR20_bit          _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<HADR21>
extern volatile __bit                   HADR21              __at(0x1AFD);	// @ (0x35F * 8 + 5)
#define                                 HADR21_bit          _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x1AEB);	// @ (0x35D * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x1AEC);	// @ (0x35D * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x1AED);	// @ (0x35D * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x1AEE);	// @ (0x35D * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x1AEF);	// @ (0x35D * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x1AF0);	// @ (0x35E * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x1AF1);	// @ (0x35E * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x59E);	// @ (0xB3 * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x596);	// @ (0xB2 * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x257);	// @ (0x4A * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE0<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x2551);	// @ (0x4AA * 8 + 1)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x25B1);	// @ (0x4B6 * 8 + 1)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR0,1)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR0<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x24F1);	// @ (0x49E * 8 + 1)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR0,1)
// PMD0<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x315);	// @ (0x62 * 8 + 5)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD0,5)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x255);	// @ (0x4A * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x254);	// @ (0x4A * 8 + 4)
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x258);	// @ (0x4B * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x259);	// @ (0x4B * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x25A);	// @ (0x4B * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x25B);	// @ (0x4B * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// I2C1CNTL<I2C1CNT0>
extern volatile __bit                   I2C1CNT0            __at(0x1450);	// @ (0x28A * 8 + 0)
#define                                 I2C1CNT0_bit        _BIT_ACCESS(I2C1CNTL,0)
// I2C1CNTL<I2C1CNT1>
extern volatile __bit                   I2C1CNT1            __at(0x1451);	// @ (0x28A * 8 + 1)
#define                                 I2C1CNT1_bit        _BIT_ACCESS(I2C1CNTL,1)
// I2C1CNTH<I2C1CNT10>
extern volatile __bit                   I2C1CNT10           __at(0x145A);	// @ (0x28B * 8 + 2)
#define                                 I2C1CNT10_bit       _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<I2C1CNT11>
extern volatile __bit                   I2C1CNT11           __at(0x145B);	// @ (0x28B * 8 + 3)
#define                                 I2C1CNT11_bit       _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<I2C1CNT12>
extern volatile __bit                   I2C1CNT12           __at(0x145C);	// @ (0x28B * 8 + 4)
#define                                 I2C1CNT12_bit       _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<I2C1CNT13>
extern volatile __bit                   I2C1CNT13           __at(0x145D);	// @ (0x28B * 8 + 5)
#define                                 I2C1CNT13_bit       _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<I2C1CNT14>
extern volatile __bit                   I2C1CNT14           __at(0x145E);	// @ (0x28B * 8 + 6)
#define                                 I2C1CNT14_bit       _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<I2C1CNT15>
extern volatile __bit                   I2C1CNT15           __at(0x145F);	// @ (0x28B * 8 + 7)
#define                                 I2C1CNT15_bit       _BIT_ACCESS(I2C1CNTH,7)
// I2C1CNTL<I2C1CNT2>
extern volatile __bit                   I2C1CNT2            __at(0x1452);	// @ (0x28A * 8 + 2)
#define                                 I2C1CNT2_bit        _BIT_ACCESS(I2C1CNTL,2)
// I2C1CNTL<I2C1CNT3>
extern volatile __bit                   I2C1CNT3            __at(0x1453);	// @ (0x28A * 8 + 3)
#define                                 I2C1CNT3_bit        _BIT_ACCESS(I2C1CNTL,3)
// I2C1CNTL<I2C1CNT4>
extern volatile __bit                   I2C1CNT4            __at(0x1454);	// @ (0x28A * 8 + 4)
#define                                 I2C1CNT4_bit        _BIT_ACCESS(I2C1CNTL,4)
// I2C1CNTL<I2C1CNT5>
extern volatile __bit                   I2C1CNT5            __at(0x1455);	// @ (0x28A * 8 + 5)
#define                                 I2C1CNT5_bit        _BIT_ACCESS(I2C1CNTL,5)
// I2C1CNTL<I2C1CNT6>
extern volatile __bit                   I2C1CNT6            __at(0x1456);	// @ (0x28A * 8 + 6)
#define                                 I2C1CNT6_bit        _BIT_ACCESS(I2C1CNTL,6)
// I2C1CNTL<I2C1CNT7>
extern volatile __bit                   I2C1CNT7            __at(0x1457);	// @ (0x28A * 8 + 7)
#define                                 I2C1CNT7_bit        _BIT_ACCESS(I2C1CNTL,7)
// I2C1CNTH<I2C1CNT8>
extern volatile __bit                   I2C1CNT8            __at(0x1458);	// @ (0x28B * 8 + 0)
#define                                 I2C1CNT8_bit        _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<I2C1CNT9>
extern volatile __bit                   I2C1CNT9            __at(0x1459);	// @ (0x28B * 8 + 1)
#define                                 I2C1CNT9_bit        _BIT_ACCESS(I2C1CNTH,1)
// PIE7<I2C1EIE>
extern volatile __bit                   I2C1EIE             __at(0x258B);	// @ (0x4B1 * 8 + 3)
#define                                 I2C1EIE_bit         _BIT_ACCESS(PIE7,3)
// PIR7<I2C1EIF>
extern volatile __bit                   I2C1EIF             __at(0x25EB);	// @ (0x4BD * 8 + 3)
