garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
#define                                 I2C1EIF_bit         _BIT_ACCESS(PIR7,3)
// IPR7<I2C1EIP>
extern volatile __bit                   I2C1EIP             __at(0x252B);	// @ (0x4A5 * 8 + 3)
#define                                 I2C1EIP_bit         _BIT_ACCESS(IPR7,3)
// PIE7<I2C1IE>
extern volatile __bit                   I2C1IE              __at(0x258A);	// @ (0x4B1 * 8 + 2)
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE7,2)
// PIR7<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x25EA);	// @ (0x4BD * 8 + 2)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR7,2)
// IPR7<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x252A);	// @ (0x4A5 * 8 + 2)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR7,2)
// PMD3<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD3,3)
// PIE7<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x2588);	// @ (0x4B1 * 8 + 0)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE7,0)
// PIR7<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x25E8);	// @ (0x4BD * 8 + 0)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR7,0)
// IPR7<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x2528);	// @ (0x4A5 * 8 + 0)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR7,0)
// I2C1SCLPPS<I2C1SCLPPS0>
extern volatile __bit                   I2C1SCLPPS0         __at(0x1388);	// @ (0x271 * 8 + 0)
#define                                 I2C1SCLPPS0_bit     _BIT_ACCESS(I2C1SCLPPS,0)
// I2C1SCLPPS<I2C1SCLPPS1>
extern volatile __bit                   I2C1SCLPPS1         __at(0x1389);	// @ (0x271 * 8 + 1)
#define                                 I2C1SCLPPS1_bit     _BIT_ACCESS(I2C1SCLPPS,1)
// I2C1SCLPPS<I2C1SCLPPS2>
extern volatile __bit                   I2C1SCLPPS2         __at(0x138A);	// @ (0x271 * 8 + 2)
#define                                 I2C1SCLPPS2_bit     _BIT_ACCESS(I2C1SCLPPS,2)
// I2C1SCLPPS<I2C1SCLPPS3>
extern volatile __bit                   I2C1SCLPPS3         __at(0x138B);	// @ (0x271 * 8 + 3)
#define                                 I2C1SCLPPS3_bit     _BIT_ACCESS(I2C1SCLPPS,3)
// I2C1SCLPPS<I2C1SCLPPS4>
extern volatile __bit                   I2C1SCLPPS4         __at(0x138C);	// @ (0x271 * 8 + 4)
#define                                 I2C1SCLPPS4_bit     _BIT_ACCESS(I2C1SCLPPS,4)
// I2C1SCLPPS<I2C1SCLPPS5>
extern volatile __bit                   I2C1SCLPPS5         __at(0x138D);	// @ (0x271 * 8 + 5)
#define                                 I2C1SCLPPS5_bit     _BIT_ACCESS(I2C1SCLPPS,5)
// I2C1SDAPPS<I2C1SDAPPS0>
extern volatile __bit                   I2C1SDAPPS0         __at(0x1380);	// @ (0x270 * 8 + 0)
#define                                 I2C1SDAPPS0_bit     _BIT_ACCESS(I2C1SDAPPS,0)
// I2C1SDAPPS<I2C1SDAPPS1>
extern volatile __bit                   I2C1SDAPPS1         __at(0x1381);	// @ (0x270 * 8 + 1)
#define                                 I2C1SDAPPS1_bit     _BIT_ACCESS(I2C1SDAPPS,1)
// I2C1SDAPPS<I2C1SDAPPS2>
extern volatile __bit                   I2C1SDAPPS2         __at(0x1382);	// @ (0x270 * 8 + 2)
#define                                 I2C1SDAPPS2_bit     _BIT_ACCESS(I2C1SDAPPS,2)
// I2C1SDAPPS<I2C1SDAPPS3>
extern volatile __bit                   I2C1SDAPPS3         __at(0x1383);	// @ (0x270 * 8 + 3)
#define                                 I2C1SDAPPS3_bit     _BIT_ACCESS(I2C1SDAPPS,3)
// I2C1SDAPPS<I2C1SDAPPS4>
extern volatile __bit                   I2C1SDAPPS4         __at(0x1384);	// @ (0x270 * 8 + 4)
#define                                 I2C1SDAPPS4_bit     _BIT_ACCESS(I2C1SDAPPS,4)
// I2C1SDAPPS<I2C1SDAPPS5>
extern volatile __bit                   I2C1SDAPPS5         __at(0x1385);	// @ (0x270 * 8 + 5)
#define                                 I2C1SDAPPS5_bit     _BIT_ACCESS(I2C1SDAPPS,5)
// PIE7<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x2589);	// @ (0x4B1 * 8 + 1)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE7,1)
// PIR7<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x25E9);	// @ (0x4BD * 8 + 1)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR7,1)
// IPR7<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x2529);	// @ (0x4A5 * 8 + 1)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR7,1)
// I2C2CNTL<I2C2CNT0>
extern volatile __bit                   I2C2CNT0            __at(0x1508);	// @ (0x2A1 * 8 + 0)
#define                                 I2C2CNT0_bit        _BIT_ACCESS(I2C2CNTL,0)
// I2C2CNTL<I2C2CNT1>
extern volatile __bit                   I2C2CNT1            __at(0x1509);	// @ (0x2A1 * 8 + 1)
#define                                 I2C2CNT1_bit        _BIT_ACCESS(I2C2CNTL,1)
// I2C2CNTH<I2C2CNT10>
extern volatile __bit                   I2C2CNT10           __at(0x1512);	// @ (0x2A2 * 8 + 2)
#define                                 I2C2CNT10_bit       _BIT_ACCESS(I2C2CNTH,2)
// I2C2CNTH<I2C2CNT11>
extern volatile __bit                   I2C2CNT11           __at(0x1513);	// @ (0x2A2 * 8 + 3)
#define                                 I2C2CNT11_bit       _BIT_ACCESS(I2C2CNTH,3)
// I2C2CNTH<I2C2CNT12>
extern volatile __bit                   I2C2CNT12           __at(0x1514);	// @ (0x2A2 * 8 + 4)
#define                                 I2C2CNT12_bit       _BIT_ACCESS(I2C2CNTH,4)
// I2C2CNTH<I2C2CNT13>
extern volatile __bit                   I2C2CNT13           __at(0x1515);	// @ (0x2A2 * 8 + 5)
#define                                 I2C2CNT13_bit       _BIT_ACCESS(I2C2CNTH,5)
// I2C2CNTH<I2C2CNT14>
extern volatile __bit                   I2C2CNT14           __at(0x1516);	// @ (0x2A2 * 8 + 6)
#define                                 I2C2CNT14_bit       _BIT_ACCESS(I2C2CNTH,6)
// I2C2CNTH<I2C2CNT15>
extern volatile __bit                   I2C2CNT15           __at(0x1517);	// @ (0x2A2 * 8 + 7)
#define                                 I2C2CNT15_bit       _BIT_ACCESS(I2C2CNTH,7)
// I2C2CNTL<I2C2CNT2>
extern volatile __bit                   I2C2CNT2            __at(0x150A);	// @ (0x2A1 * 8 + 2)
#define                                 I2C2CNT2_bit        _BIT_ACCESS(I2C2CNTL,2)
// I2C2CNTL<I2C2CNT3>
extern volatile __bit                   I2C2CNT3            __at(0x150B);	// @ (0x2A1 * 8 + 3)
#define                                 I2C2CNT3_bit        _BIT_ACCESS(I2C2CNTL,3)
// I2C2CNTL<I2C2CNT4>
extern volatile __bit                   I2C2CNT4            __at(0x150C);	// @ (0x2A1 * 8 + 4)
#define                                 I2C2CNT4_bit        _BIT_ACCESS(I2C2CNTL,4)
// I2C2CNTL<I2C2CNT5>
extern volatile __bit                   I2C2CNT5            __at(0x150D);	// @ (0x2A1 * 8 + 5)
#define                                 I2C2CNT5_bit        _BIT_ACCESS(I2C2CNTL,5)
// I2C2CNTL<I2C2CNT6>
extern volatile __bit                   I2C2CNT6            __at(0x150E);	// @ (0x2A1 * 8 + 6)
#define                                 I2C2CNT6_bit        _BIT_ACCESS(I2C2CNTL,6)
// I2C2CNTL<I2C2CNT7>
extern volatile __bit                   I2C2CNT7            __at(0x150F);	// @ (0x2A1 * 8 + 7)
#define                                 I2C2CNT7_bit        _BIT_ACCESS(I2C2CNTL,7)
// I2C2CNTH<I2C2CNT8>
extern volatile __bit                   I2C2CNT8            __at(0x1510);	// @ (0x2A2 * 8 + 0)
#define                                 I2C2CNT8_bit        _BIT_ACCESS(I2C2CNTH,0)
// I2C2CNTH<I2C2CNT9>
extern volatile __bit                   I2C2CNT9            __at(0x1511);	// @ (0x2A2 * 8 + 1)
#define                                 I2C2CNT9_bit        _BIT_ACCESS(I2C2CNTH,1)
// PIE1<I2C2EIE>
extern volatile __bit                   I2C2EIE             __at(0x255F);	// @ (0x4AB * 8 + 7)
#define                                 I2C2EIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<I2C2EIF>
extern volatile __bit                   I2C2EIF             __at(0x25BF);	// @ (0x4B7 * 8 + 7)
#define                                 I2C2EIF_bit         _BIT_ACCESS(PIR1,7)
// IPR1<I2C2EIP>
extern volatile __bit                   I2C2EIP             __at(0x24FF);	// @ (0x49F * 8 + 7)
#define                                 I2C2EIP_bit         _BIT_ACCESS(IPR1,7)
// PIE1<I2C2IE>
extern volatile __bit                   I2C2IE              __at(0x255E);	// @ (0x4AB * 8 + 6)
#define                                 I2C2IE_bit          _BIT_ACCESS(PIE1,6)
// PIR1<I2C2IF>
extern volatile __bit                   I2C2IF              __at(0x25BE);	// @ (0x4B7 * 8 + 6)
#define                                 I2C2IF_bit          _BIT_ACCESS(PIR1,6)
// IPR1<I2C2IP>
extern volatile __bit                   I2C2IP              __at(0x24FE);	// @ (0x49F * 8 + 6)
#define                                 I2C2IP_bit          _BIT_ACCESS(IPR1,6)
// PMD4<I2C2MD>
extern volatile __bit                   I2C2MD              __at(0x330);	// @ (0x66 * 8 + 0)
#define                                 I2C2MD_bit          _BIT_ACCESS(PMD4,0)
// PIE1<I2C2RXIE>
extern volatile __bit                   I2C2RXIE            __at(0x255C);	// @ (0x4AB * 8 + 4)
#define                                 I2C2RXIE_bit        _BIT_ACCESS(PIE1,4)
// PIR1<I2C2RXIF>
extern volatile __bit                   I2C2RXIF            __at(0x25BC);	// @ (0x4B7 * 8 + 4)
#define                                 I2C2RXIF_bit        _BIT_ACCESS(PIR1,4)
// IPR1<I2C2RXIP>
extern volatile __bit                   I2C2RXIP            __at(0x24FC);	// @ (0x49F * 8 + 4)
#define                                 I2C2RXIP_bit        _BIT_ACCESS(IPR1,4)
// I2C2SCLPPS<I2C2SCLPPS0>
extern volatile __bit                   I2C2SCLPPS0         __at(0x1300);	// @ (0x260 * 8 + 0)
#define                                 I2C2SCLPPS0_bit     _BIT_ACCESS(I2C2SCLPPS,0)
// I2C2SCLPPS<I2C2SCLPPS1>
extern volatile __bit                   I2C2SCLPPS1         __at(0x1301);	// @ (0x260 * 8 + 1)
#define                                 I2C2SCLPPS1_bit     _BIT_ACCESS(I2C2SCLPPS,1)
// I2C2SCLPPS<I2C2SCLPPS2>
extern volatile __bit                   I2C2SCLPPS2         __at(0x1302);	// @ (0x260 * 8 + 2)
#define                                 I2C2SCLPPS2_bit     _BIT_ACCESS(I2C2SCLPPS,2)
// I2C2SCLPPS<I2C2SCLPPS3>
extern volatile __bit                   I2C2SCLPPS3         __at(0x1303);	// @ (0x260 * 8 + 3)
#define                                 I2C2SCLPPS3_bit     _BIT_ACCESS(I2C2SCLPPS,3)
// I2C2SCLPPS<I2C2SCLPPS4>
extern volatile __bit                   I2C2SCLPPS4         __at(0x1304);	// @ (0x260 * 8 + 4)
#define                                 I2C2SCLPPS4_bit     _BIT_ACCESS(I2C2SCLPPS,4)
// I2C2SCLPPS<I2C2SCLPPS5>
extern volatile __bit                   I2C2SCLPPS5         __at(0x1305);	// @ (0x260 * 8 + 5)
#define                                 I2C2SCLPPS5_bit     _BIT_ACCESS(I2C2SCLPPS,5)
// I2C2SDAPPS<I2C2SDAPPS0>
extern volatile __bit                   I2C2SDAPPS0         __at(0x12F8);	// @ (0x25F * 8 + 0)
#define                                 I2C2SDAPPS0_bit     _BIT_ACCESS(I2C2SDAPPS,0)
// I2C2SDAPPS<I2C2SDAPPS1>
extern volatile __bit                   I2C2SDAPPS1         __at(0x12F9);	// @ (0x25F * 8 + 1)
#define                                 I2C2SDAPPS1_bit     _BIT_ACCESS(I2C2SDAPPS,1)
// I2C2SDAPPS<I2C2SDAPPS2>
extern volatile __bit                   I2C2SDAPPS2         __at(0x12FA);	// @ (0x25F * 8 + 2)
#define                                 I2C2SDAPPS2_bit     _BIT_ACCESS(I2C2SDAPPS,2)
// I2C2SDAPPS<I2C2SDAPPS3>
extern volatile __bit                   I2C2SDAPPS3         __at(0x12FB);	// @ (0x25F * 8 + 3)
#define                                 I2C2SDAPPS3_bit     _BIT_ACCESS(I2C2SDAPPS,3)
// I2C2SDAPPS<I2C2SDAPPS4>
extern volatile __bit                   I2C2SDAPPS4         __at(0x12FC);	// @ (0x25F * 8 + 4)
#define                                 I2C2SDAPPS4_bit     _BIT_ACCESS(I2C2SDAPPS,4)
// I2C2SDAPPS<I2C2SDAPPS5>
extern volatile __bit                   I2C2SDAPPS5         __at(0x12FD);	// @ (0x25F * 8 + 5)
#define                                 I2C2SDAPPS5_bit     _BIT_ACCESS(I2C2SDAPPS,5)
// PIE1<I2C2TXIE>
extern volatile __bit                   I2C2TXIE            __at(0x255D);	// @ (0x4AB * 8 + 5)
#define                                 I2C2TXIE_bit        _BIT_ACCESS(PIE1,5)
// PIR1<I2C2TXIF>
extern volatile __bit                   I2C2TXIF            __at(0x25BD);	// @ (0x4B7 * 8 + 5)
#define                                 I2C2TXIF_bit        _BIT_ACCESS(PIR1,5)
// IPR1<I2C2TXIP>
extern volatile __bit                   I2C2TXIP            __at(0x24FD);	// @ (0x49F * 8 + 5)
#define                                 I2C2TXIP_bit        _BIT_ACCESS(IPR1,5)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x2797);	// @ (0x4F2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x1E0D);	// @ (0x3C1 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x2218);	// @ (0x443 * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x2219);	// @ (0x443 * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x2222);	// @ (0x444 * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x2223);	// @ (0x444 * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x2224);	// @ (0x444 * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x2225);	// @ (0x444 * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x2226);	// @ (0x444 * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x2227);	// @ (0x444 * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x2228);	// @ (0x445 * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x2229);	// @ (0x445 * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x222A);	// @ (0x445 * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x222B);	// @ (0x445 * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x221A);	// @ (0x443 * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x221B);	// @ (0x443 * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x221C);	// @ (0x443 * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x221D);	// @ (0x443 * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x221E);	// @ (0x443 * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x221F);	// @ (0x443 * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x2220);	// @ (0x444 * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x2221);	// @ (0x444 * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x2020);	// @ (0x404 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x2021);	// @ (0x404 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x2022);	// @ (0x404 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x2023);	// @ (0x404 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x2024);	// @ (0x404 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x2025);	// @ (0x404 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x2026);	// @ (0x404 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x2027);	// @ (0x404 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x2060);	// @ (0x40C * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x2061);	// @ (0x40C * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x2062);	// @ (0x40C * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x2063);	// @ (0x40C * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x2064);	// @ (0x40C * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x2065);	// @ (0x40C * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x2066);	// @ (0x40C * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x2067);	// @ (0x40C * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x20A0);	// @ (0x414 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x20A1);	// @ (0x414 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x20A2);	// @ (0x414 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x20A3);	// @ (0x414 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x20A4);	// @ (0x414 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x20A5);	// @ (0x414 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x20A6);	// @ (0x414 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLD<INLVLD0>
extern volatile __bit                   INLVLD0             __at(0x20E0);	// @ (0x41C * 8 + 0)
#define                                 INLVLD0_bit         _BIT_ACCESS(INLVLD,0)
// INLVLD<INLVLD1>
extern volatile __bit                   INLVLD1             __at(0x20E1);	// @ (0x41C * 8 + 1)
#define                                 INLVLD1_bit         _BIT_ACCESS(INLVLD,1)
// INLVLD<INLVLD2>
extern volatile __bit                   INLVLD2             __at(0x20E2);	// @ (0x41C * 8 + 2)
#define                                 INLVLD2_bit         _BIT_ACCESS(INLVLD,2)
// INLVLD<INLVLD3>
extern volatile __bit                   INLVLD3             __at(0x20E3);	// @ (0x41C * 8 + 3)
#define                                 INLVLD3_bit         _BIT_ACCESS(INLVLD,3)
// INLVLD<INLVLD4>
extern volatile __bit                   INLVLD4             __at(0x20E4);	// @ (0x41C * 8 + 4)
#define                                 INLVLD4_bit         _BIT_ACCESS(INLVLD,4)
// INLVLD<INLVLD5>
extern volatile __bit                   INLVLD5             __at(0x20E5);	// @ (0x41C * 8 + 5)
#define                                 INLVLD5_bit         _BIT_ACCESS(INLVLD,5)
// INLVLD<INLVLD6>
extern volatile __bit                   INLVLD6             __at(0x20E6);	// @ (0x41C * 8 + 6)
#define                                 INLVLD6_bit         _BIT_ACCESS(INLVLD,6)
// INLVLD<INLVLD7>
extern volatile __bit                   INLVLD7             __at(0x20E7);	// @ (0x41C * 8 + 7)
#define                                 INLVLD7_bit         _BIT_ACCESS(INLVLD,7)
// INLVLE<INLVLE0>
extern volatile __bit                   INLVLE0             __at(0x2120);	// @ (0x424 * 8 + 0)
#define                                 INLVLE0_bit         _BIT_ACCESS(INLVLE,0)
// INLVLE<INLVLE1>
extern volatile __bit                   INLVLE1             __at(0x2121);	// @ (0x424 * 8 + 1)
#define                                 INLVLE1_bit         _BIT_ACCESS(INLVLE,1)
// INLVLE<INLVLE2>
extern volatile __bit                   INLVLE2             __at(0x2122);	// @ (0x424 * 8 + 2)
#define                                 INLVLE2_bit         _BIT_ACCESS(INLVLE,2)
// INLVLE<INLVLE3>
