garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.h
#define                                 TU16ACPOL_bit       _BIT_ACCESS(TU16ACON0,6)
// TU16ACRL<TU16ACR0>
extern volatile __bit                   TU16ACR0            __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ACR0_bit        _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACR1>
extern volatile __bit                   TU16ACR1            __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ACR1_bit        _BIT_ACCESS(TU16ACRL,1)
// TU16ACRH<TU16ACR10>
extern volatile __bit                   TU16ACR10           __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ACR10_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACR11>
extern volatile __bit                   TU16ACR11           __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ACR11_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACR12>
extern volatile __bit                   TU16ACR12           __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ACR12_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACR13>
extern volatile __bit                   TU16ACR13           __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ACR13_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACR14>
extern volatile __bit                   TU16ACR14           __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACR14_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACR15>
extern volatile __bit                   TU16ACR15           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ACR15_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACR2>
extern volatile __bit                   TU16ACR2            __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ACR2_bit        _BIT_ACCESS(TU16ACRL,2)
// TU16ACRT<TU16ACR24>
extern volatile __bit                   TU16ACR24           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACR24_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACR25>
extern volatile __bit                   TU16ACR25           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACR25_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACR26>
extern volatile __bit                   TU16ACR26           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACR26_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACR27>
extern volatile __bit                   TU16ACR27           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACR27_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACR28>
extern volatile __bit                   TU16ACR28           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACR28_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACR29>
extern volatile __bit                   TU16ACR29           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACR29_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRL<TU16ACR3>
extern volatile __bit                   TU16ACR3            __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ACR3_bit        _BIT_ACCESS(TU16ACRL,3)
// TU16ACRT<TU16ACR30>
extern volatile __bit                   TU16ACR30           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACR30_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACR31>
extern volatile __bit                   TU16ACR31           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACR31_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16ACRL<TU16ACR4>
extern volatile __bit                   TU16ACR4            __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ACR4_bit        _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACR5>
extern volatile __bit                   TU16ACR5            __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ACR5_bit        _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACR6>
extern volatile __bit                   TU16ACR6            __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ACR6_bit        _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACR7>
extern volatile __bit                   TU16ACR7            __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ACR7_bit        _BIT_ACCESS(TU16ACRL,7)
// TU16ACRH<TU16ACR8>
extern volatile __bit                   TU16ACR8            __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ACR8_bit        _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACR9>
extern volatile __bit                   TU16ACR9            __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ACR9_bit        _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH0>
extern volatile __bit                   TU16ACRH0           __at(0x1D10);	// @ (0x3A2 * 8 + 0)
#define                                 TU16ACRH0_bit       _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACRH1>
extern volatile __bit                   TU16ACRH1           __at(0x1D11);	// @ (0x3A2 * 8 + 1)
#define                                 TU16ACRH1_bit       _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH2>
extern volatile __bit                   TU16ACRH2           __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ACRH2_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACRH3>
extern volatile __bit                   TU16ACRH3           __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ACRH3_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACRH4>
extern volatile __bit                   TU16ACRH4           __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ACRH4_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACRH5>
extern volatile __bit                   TU16ACRH5           __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ACRH5_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACRH6>
extern volatile __bit                   TU16ACRH6           __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACRH6_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACRH7>
extern volatile __bit                   TU16ACRH7           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ACRH7_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACRL0>
extern volatile __bit                   TU16ACRL0           __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ACRL0_bit       _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACRL1>
extern volatile __bit                   TU16ACRL1           __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ACRL1_bit       _BIT_ACCESS(TU16ACRL,1)
// TU16ACRL<TU16ACRL2>
extern volatile __bit                   TU16ACRL2           __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ACRL2_bit       _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACRL3>
extern volatile __bit                   TU16ACRL3           __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 TU16ACRL3_bit       _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACRL4>
extern volatile __bit                   TU16ACRL4           __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 TU16ACRL4_bit       _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACRL5>
extern volatile __bit                   TU16ACRL5           __at(0x1D0D);	// @ (0x3A1 * 8 + 5)
#define                                 TU16ACRL5_bit       _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACRL6>
extern volatile __bit                   TU16ACRL6           __at(0x1D0E);	// @ (0x3A1 * 8 + 6)
#define                                 TU16ACRL6_bit       _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACRL7>
extern volatile __bit                   TU16ACRL7           __at(0x1D0F);	// @ (0x3A1 * 8 + 7)
#define                                 TU16ACRL7_bit       _BIT_ACCESS(TU16ACRL,7)
// TU16ACRT<TU16ACRT0>
extern volatile __bit                   TU16ACRT0           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACRT0_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACRT1>
extern volatile __bit                   TU16ACRT1           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACRT1_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACRT2>
extern volatile __bit                   TU16ACRT2           __at(0x1D22);	// @ (0x3A4 * 8 + 2)
#define                                 TU16ACRT2_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACRT3>
extern volatile __bit                   TU16ACRT3           __at(0x1D23);	// @ (0x3A4 * 8 + 3)
#define                                 TU16ACRT3_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACRT4>
extern volatile __bit                   TU16ACRT4           __at(0x1D24);	// @ (0x3A4 * 8 + 4)
#define                                 TU16ACRT4_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACRT5>
extern volatile __bit                   TU16ACRT5           __at(0x1D25);	// @ (0x3A4 * 8 + 5)
#define                                 TU16ACRT5_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRT<TU16ACRT6>
extern volatile __bit                   TU16ACRT6           __at(0x1D26);	// @ (0x3A4 * 8 + 6)
#define                                 TU16ACRT6_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACRT7>
extern volatile __bit                   TU16ACRT7           __at(0x1D27);	// @ (0x3A4 * 8 + 7)
#define                                 TU16ACRT7_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16AHLT<TU16ACSYNC>
extern volatile __bit                   TU16ACSYNC          __at(0x1CFE);	// @ (0x39F * 8 + 6)
#define                                 TU16ACSYNC_bit      _BIT_ACCESS(TU16AHLT,6)
// TU16AHLT<TU16AEPOL>
extern volatile __bit                   TU16AEPOL           __at(0x1CFF);	// @ (0x39F * 8 + 7)
#define                                 TU16AEPOL_bit       _BIT_ACCESS(TU16AHLT,7)
// TU16AERS<TU16AERS0>
extern volatile __bit                   TU16AERS0           __at(0x1D50);	// @ (0x3AA * 8 + 0)
#define                                 TU16AERS0_bit       _BIT_ACCESS(TU16AERS,0)
// TU16AERS<TU16AERS1>
extern volatile __bit                   TU16AERS1           __at(0x1D51);	// @ (0x3AA * 8 + 1)
#define                                 TU16AERS1_bit       _BIT_ACCESS(TU16AERS,1)
// TU16AERS<TU16AERS2>
extern volatile __bit                   TU16AERS2           __at(0x1D52);	// @ (0x3AA * 8 + 2)
#define                                 TU16AERS2_bit       _BIT_ACCESS(TU16AERS,2)
// TU16AERS<TU16AERS3>
extern volatile __bit                   TU16AERS3           __at(0x1D53);	// @ (0x3AA * 8 + 3)
#define                                 TU16AERS3_bit       _BIT_ACCESS(TU16AERS,3)
// TU16AERS<TU16AERS4>
extern volatile __bit                   TU16AERS4           __at(0x1D54);	// @ (0x3AA * 8 + 4)
#define                                 TU16AERS4_bit       _BIT_ACCESS(TU16AERS,4)
// TU16AERS<TU16AERS5>
extern volatile __bit                   TU16AERS5           __at(0x1D55);	// @ (0x3AA * 8 + 5)
#define                                 TU16AERS5_bit       _BIT_ACCESS(TU16AERS,5)
// PIE5<TU16AIE>
extern volatile __bit                   TU16AIE             __at(0x257A);	// @ (0x4AF * 8 + 2)
#define                                 TU16AIE_bit         _BIT_ACCESS(PIE5,2)
// PIR5<TU16AIF>
extern volatile __bit                   TU16AIF             __at(0x25DA);	// @ (0x4BB * 8 + 2)
#define                                 TU16AIF_bit         _BIT_ACCESS(PIR5,2)
// IPR5<TU16AIP>
extern volatile __bit                   TU16AIP             __at(0x251A);	// @ (0x4A3 * 8 + 2)
#define                                 TU16AIP_bit         _BIT_ACCESS(IPR5,2)
// TU16ACON1<TU16ALIMIT>
extern volatile __bit                   TU16ALIMIT          __at(0x1CF4);	// @ (0x39E * 8 + 4)
#define                                 TU16ALIMIT_bit      _BIT_ACCESS(TU16ACON1,4)
// PMD5<TU16AMD>
extern volatile __bit                   TU16AMD             __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 TU16AMD_bit         _BIT_ACCESS(PMD5,1)
// TU16ACON0<TU16AOM>
extern volatile __bit                   TU16AOM             __at(0x1CED);	// @ (0x39D * 8 + 5)
#define                                 TU16AOM_bit         _BIT_ACCESS(TU16ACON0,5)
// TU16ACON0<TU16AON>
extern volatile __bit                   TU16AON             __at(0x1CEF);	// @ (0x39D * 8 + 7)
#define                                 TU16AON_bit         _BIT_ACCESS(TU16ACON0,7)
// TU16ACON0<TU16AOPOL>
extern volatile __bit                   TU16AOPOL           __at(0x1CEC);	// @ (0x39D * 8 + 4)
#define                                 TU16AOPOL_bit       _BIT_ACCESS(TU16ACON0,4)
// TU16APRL<TU16APR0>
extern volatile __bit                   TU16APR0            __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16APR0_bit        _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APR1>
extern volatile __bit                   TU16APR1            __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16APR1_bit        _BIT_ACCESS(TU16APRL,1)
// TU16APRH<TU16APR10>
extern volatile __bit                   TU16APR10           __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APR10_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APR11>
extern volatile __bit                   TU16APR11           __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APR11_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APR12>
extern volatile __bit                   TU16APR12           __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APR12_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APR13>
extern volatile __bit                   TU16APR13           __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APR13_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APR14>
extern volatile __bit                   TU16APR14           __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APR14_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APR15>
extern volatile __bit                   TU16APR15           __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APR15_bit       _BIT_ACCESS(TU16APRH,7)
// TU16APRL<TU16APR2>
extern volatile __bit                   TU16APR2            __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16APR2_bit        _BIT_ACCESS(TU16APRL,2)
// TU16APRT<TU16APR24>
extern volatile __bit                   TU16APR24           __at(0x1D40);	// @ (0x3A8 * 8 + 0)
#define                                 TU16APR24_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APR25>
extern volatile __bit                   TU16APR25           __at(0x1D41);	// @ (0x3A8 * 8 + 1)
#define                                 TU16APR25_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APR26>
extern volatile __bit                   TU16APR26           __at(0x1D42);	// @ (0x3A8 * 8 + 2)
#define                                 TU16APR26_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APR27>
extern volatile __bit                   TU16APR27           __at(0x1D43);	// @ (0x3A8 * 8 + 3)
#define                                 TU16APR27_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APR28>
extern volatile __bit                   TU16APR28           __at(0x1D44);	// @ (0x3A8 * 8 + 4)
#define                                 TU16APR28_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APR29>
extern volatile __bit                   TU16APR29           __at(0x1D45);	// @ (0x3A8 * 8 + 5)
#define                                 TU16APR29_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRL<TU16APR3>
extern volatile __bit                   TU16APR3            __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16APR3_bit        _BIT_ACCESS(TU16APRL,3)
// TU16APRT<TU16APR30>
extern volatile __bit                   TU16APR30           __at(0x1D46);	// @ (0x3A8 * 8 + 6)
#define                                 TU16APR30_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APR31>
extern volatile __bit                   TU16APR31           __at(0x1D47);	// @ (0x3A8 * 8 + 7)
#define                                 TU16APR31_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APRL<TU16APR4>
extern volatile __bit                   TU16APR4            __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16APR4_bit        _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APR5>
extern volatile __bit                   TU16APR5            __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16APR5_bit        _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APR6>
extern volatile __bit                   TU16APR6            __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16APR6_bit        _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APR7>
extern volatile __bit                   TU16APR7            __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16APR7_bit        _BIT_ACCESS(TU16APRL,7)
// TU16APRH<TU16APR8>
extern volatile __bit                   TU16APR8            __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APR8_bit        _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APR9>
extern volatile __bit                   TU16APR9            __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APR9_bit        _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH0>
extern volatile __bit                   TU16APRH0           __at(0x1D30);	// @ (0x3A6 * 8 + 0)
#define                                 TU16APRH0_bit       _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APRH1>
extern volatile __bit                   TU16APRH1           __at(0x1D31);	// @ (0x3A6 * 8 + 1)
#define                                 TU16APRH1_bit       _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH2>
extern volatile __bit                   TU16APRH2           __at(0x1D32);	// @ (0x3A6 * 8 + 2)
#define                                 TU16APRH2_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APRH3>
extern volatile __bit                   TU16APRH3           __at(0x1D33);	// @ (0x3A6 * 8 + 3)
#define                                 TU16APRH3_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APRH4>
extern volatile __bit                   TU16APRH4           __at(0x1D34);	// @ (0x3A6 * 8 + 4)
#define                                 TU16APRH4_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APRH5>
extern volatile __bit                   TU16APRH5           __at(0x1D35);	// @ (0x3A6 * 8 + 5)
#define                                 TU16APRH5_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APRH6>
extern volatile __bit                   TU16APRH6           __at(0x1D36);	// @ (0x3A6 * 8 + 6)
#define                                 TU16APRH6_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APRH7>
extern volatile __bit                   TU16APRH7           __at(0x1D37);	// @ (0x3A6 * 8 + 7)
#define                                 TU16APRH7_bit       _BIT_ACCESS(TU16APRH,7)
// TU16ACON0<TU16APRIE>
extern volatile __bit                   TU16APRIE           __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 TU16APRIE_bit       _BIT_ACCESS(TU16ACON0,2)
// TU16ACON1<TU16APRIF>
extern volatile __bit                   TU16APRIF           __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 TU16APRIF_bit       _BIT_ACCESS(TU16ACON1,2)
// TU16APRL<TU16APRL0>
extern volatile __bit                   TU16APRL0           __at(0x1D28);	// @ (0x3A5 * 8 + 0)
#define                                 TU16APRL0_bit       _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APRL1>
extern volatile __bit                   TU16APRL1           __at(0x1D29);	// @ (0x3A5 * 8 + 1)
#define                                 TU16APRL1_bit       _BIT_ACCESS(TU16APRL,1)
// TU16APRL<TU16APRL2>
extern volatile __bit                   TU16APRL2           __at(0x1D2A);	// @ (0x3A5 * 8 + 2)
#define                                 TU16APRL2_bit       _BIT_ACCESS(TU16APRL,2)
// TU16APRL<TU16APRL3>
extern volatile __bit                   TU16APRL3           __at(0x1D2B);	// @ (0x3A5 * 8 + 3)
#define                                 TU16APRL3_bit       _BIT_ACCESS(TU16APRL,3)
// TU16APRL<TU16APRL4>
extern volatile __bit                   TU16APRL4           __at(0x1D2C);	// @ (0x3A5 * 8 + 4)
#define                                 TU16APRL4_bit       _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APRL5>
extern volatile __bit                   TU16APRL5           __at(0x1D2D);	// @ (0x3A5 * 8 + 5)
#define                                 TU16APRL5_bit       _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APRL6>
extern volatile __bit                   TU16APRL6           __at(0x1D2E);	// @ (0x3A5 * 8 + 6)
#define                                 TU16APRL6_bit       _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APRL7>
extern volatile __bit                   TU16APRL7           __at(0x1D2F);	// @ (0x3A5 * 8 + 7)
#define                                 TU16APRL7_bit       _BIT_ACCESS(TU16APRL,7)
// TU16APRT<TU16APRT0>
extern volatile __bit                   TU16APRT0           __at(0x1D40);	// @ (0x3A8 * 8 + 0)
#define                                 TU16APRT0_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APRT1>
extern volatile __bit                   TU16APRT1           __at(0x1D41);	// @ (0x3A8 * 8 + 1)
#define                                 TU16APRT1_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APRT2>
extern volatile __bit                   TU16APRT2           __at(0x1D42);	// @ (0x3A8 * 8 + 2)
#define                                 TU16APRT2_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APRT3>
extern volatile __bit                   TU16APRT3           __at(0x1D43);	// @ (0x3A8 * 8 + 3)
#define                                 TU16APRT3_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APRT4>
extern volatile __bit                   TU16APRT4           __at(0x1D44);	// @ (0x3A8 * 8 + 4)
#define                                 TU16APRT4_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APRT5>
extern volatile __bit                   TU16APRT5           __at(0x1D45);	// @ (0x3A8 * 8 + 5)
#define                                 TU16APRT5_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRT<TU16APRT6>
extern volatile __bit                   TU16APRT6           __at(0x1D46);	// @ (0x3A8 * 8 + 6)
#define                                 TU16APRT6_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APRT7>
extern volatile __bit                   TU16APRT7           __at(0x1D47);	// @ (0x3A8 * 8 + 7)
#define                                 TU16APRT7_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APS<TU16APS0>
extern volatile __bit                   TU16APS0            __at(0x1D00);	// @ (0x3A0 * 8 + 0)
#define                                 TU16APS0_bit        _BIT_ACCESS(TU16APS,0)
// TU16APS<TU16APS1>
extern volatile __bit                   TU16APS1            __at(0x1D01);	// @ (0x3A0 * 8 + 1)
#define                                 TU16APS1_bit        _BIT_ACCESS(TU16APS,1)
// TU16APS<TU16APS2>
extern volatile __bit                   TU16APS2            __at(0x1D02);	// @ (0x3A0 * 8 + 2)
#define                                 TU16APS2_bit        _BIT_ACCESS(TU16APS,2)
// TU16APS<TU16APS3>
extern volatile __bit                   TU16APS3            __at(0x1D03);	// @ (0x3A0 * 8 + 3)
#define                                 TU16APS3_bit        _BIT_ACCESS(TU16APS,3)
// TU16APS<TU16APS4>
extern volatile __bit                   TU16APS4            __at(0x1D04);	// @ (0x3A0 * 8 + 4)
